"use client";

import React from 'react';
import Image from 'next/image';
import Link from "next/link";

import Box from '@mui/material/Box';
import Typography from '@mui/material/Typography';

// libs
import {imageLoader} from "@/libs/imageLoader";

interface searchItem {
    id: number;
    linkUrl: string;
    linkNavigation: string;
    image: string;
    title: string;
    desc: string;
    address: string;
    telephone: string;
    date: string;
}
const searchItem: searchItem[] = [
    { 
        id: 1, 
        linkUrl: '',
        linkNavigation: '',
        image: '/img/upload/map01.jpg', 
        title: 'สำนักงานศาลปกครอง', 
        desc: 'ศาลปกครองกลาง โดยมีเขตอำนาจตลอดท้องที่กรุงเทพมหานคร จังหวัดนครปฐม จังหวัดนนทบุรี จังหวัดปทุมธานีจังหวัดสมุทรปราการ และจังหวัดสมุทรสาคร รวมทั้งจังหวัดที่มิได้อยู่ในเขตอำนาจของศาลปกครองในภูมิภาค คือ จังหวัดนครนายก และจังหวัดสระบุรี', 
        address: 'เลขที่ 120 หมู่ที่ 3 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพฯ 10210', 
        telephone: 'โทรศัพท์ : 0 2141 1111 , Call Center ศาลปกครอง 1355 ', 
        date: 'เปิดทำการวันที่  9 มีนาคม 2544', 
    },
    { 
        id: 2, 
        linkUrl: '',
        linkNavigation: '',
        image: '/img/upload/map01.jpg', 
        title: 'สำนักงานศาลปกครอง', 
        desc: 'ศาลปกครองกลาง โดยมีเขตอำนาจตลอดท้องที่กรุงเทพมหานคร จังหวัดนครปฐม จังหวัดนนทบุรี จังหวัดปทุมธานีจังหวัดสมุทรปราการ และจังหวัดสมุทรสาคร รวมทั้งจังหวัดที่มิได้อยู่ในเขตอำนาจของศาลปกครองในภูมิภาค คือ จังหวัดนครนายก และจังหวัดสระบุรี', 
        address: 'เลขที่ 120 หมู่ที่ 3 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพฯ 10210', 
        telephone: 'โทรศัพท์ : 0 2141 1111 , Call Center ศาลปกครอง 1355 ', 
        date: 'เปิดทำการวันที่  9 มีนาคม 2544', 
    },
    { 
        id: 3, 
        linkUrl: '',
        linkNavigation: '',
        image: '/img/upload/map01.jpg', 
        title: 'สำนักงานศาลปกครอง', 
        desc: 'ศาลปกครองกลาง โดยมีเขตอำนาจตลอดท้องที่กรุงเทพมหานคร จังหวัดนครปฐม จังหวัดนนทบุรี จังหวัดปทุมธานีจังหวัดสมุทรปราการ และจังหวัดสมุทรสาคร รวมทั้งจังหวัดที่มิได้อยู่ในเขตอำนาจของศาลปกครองในภูมิภาค คือ จังหวัดนครนายก และจังหวัดสระบุรี', 
        address: 'เลขที่ 120 หมู่ที่ 3 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพฯ 10210', 
        telephone: 'โทรศัพท์ : 0 2141 1111 , Call Center ศาลปกครอง 1355 ', 
        date: 'เปิดทำการวันที่  9 มีนาคม 2544', 
    },
    { 
        id: 4, 
        linkUrl: '',
        linkNavigation: '',
        image: '/img/upload/map01.jpg', 
        title: 'สำนักงานศาลปกครอง', 
        desc: 'ศาลปกครองกลาง โดยมีเขตอำนาจตลอดท้องที่กรุงเทพมหานคร จังหวัดนครปฐม จังหวัดนนทบุรี จังหวัดปทุมธานีจังหวัดสมุทรปราการ และจังหวัดสมุทรสาคร รวมทั้งจังหวัดที่มิได้อยู่ในเขตอำนาจของศาลปกครองในภูมิภาค คือ จังหวัดนครนายก และจังหวัดสระบุรี', 
        address: 'เลขที่ 120 หมู่ที่ 3 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพฯ 10210', 
        telephone: 'โทรศัพท์ : 0 2141 1111 , Call Center ศาลปกครอง 1355 ', 
        date: 'เปิดทำการวันที่  9 มีนาคม 2544', 
    },
    { 
        id: 5, 
        linkUrl: '',
        linkNavigation: '',
        image: '/img/upload/map01.jpg', 
        title: 'สำนักงานศาลปกครอง', 
        desc: 'ศาลปกครองกลาง โดยมีเขตอำนาจตลอดท้องที่กรุงเทพมหานคร จังหวัดนครปฐม จังหวัดนนทบุรี จังหวัดปทุมธานีจังหวัดสมุทรปราการ และจังหวัดสมุทรสาคร รวมทั้งจังหวัดที่มิได้อยู่ในเขตอำนาจของศาลปกครองในภูมิภาค คือ จังหวัดนครนายก และจังหวัดสระบุรี', 
        address: 'เลขที่ 120 หมู่ที่ 3 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพฯ 10210', 
        telephone: 'โทรศัพท์ : 0 2141 1111 , Call Center ศาลปกครอง 1355 ', 
        date: 'เปิดทำการวันที่  9 มีนาคม 2544', 
    },
    { 
        id: 6, 
        linkUrl: '',
        linkNavigation: '',
        image: '/img/upload/map01.jpg', 
        title: 'สำนักงานศาลปกครอง', 
        desc: 'ศาลปกครองกลาง โดยมีเขตอำนาจตลอดท้องที่กรุงเทพมหานคร จังหวัดนครปฐม จังหวัดนนทบุรี จังหวัดปทุมธานีจังหวัดสมุทรปราการ และจังหวัดสมุทรสาคร รวมทั้งจังหวัดที่มิได้อยู่ในเขตอำนาจของศาลปกครองในภูมิภาค คือ จังหวัดนครนายก และจังหวัดสระบุรี', 
        address: 'เลขที่ 120 หมู่ที่ 3 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพฯ 10210', 
        telephone: 'โทรศัพท์ : 0 2141 1111 , Call Center ศาลปกครอง 1355 ', 
        date: 'เปิดทำการวันที่  9 มีนาคม 2544', 
    },
    { 
        id: 7, 
        linkUrl: '',
        linkNavigation: '',
        image: '/img/upload/map01.jpg', 
        title: 'สำนักงานศาลปกครอง', 
        desc: 'ศาลปกครองกลาง โดยมีเขตอำนาจตลอดท้องที่กรุงเทพมหานคร จังหวัดนครปฐม จังหวัดนนทบุรี จังหวัดปทุมธานีจังหวัดสมุทรปราการ และจังหวัดสมุทรสาคร รวมทั้งจังหวัดที่มิได้อยู่ในเขตอำนาจของศาลปกครองในภูมิภาค คือ จังหวัดนครนายก และจังหวัดสระบุรี', 
        address: 'เลขที่ 120 หมู่ที่ 3 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพฯ 10210', 
        telephone: 'โทรศัพท์ : 0 2141 1111 , Call Center ศาลปกครอง 1355 ', 
        date: 'เปิดทำการวันที่  9 มีนาคม 2544', 
    },
    { 
        id: 8, 
        linkUrl: '',
        linkNavigation: '',
        image: '/img/upload/map01.jpg', 
        title: 'สำนักงานศาลปกครอง', 
        desc: 'ศาลปกครองกลาง โดยมีเขตอำนาจตลอดท้องที่กรุงเทพมหานคร จังหวัดนครปฐม จังหวัดนนทบุรี จังหวัดปทุมธานีจังหวัดสมุทรปราการ และจังหวัดสมุทรสาคร รวมทั้งจังหวัดที่มิได้อยู่ในเขตอำนาจของศาลปกครองในภูมิภาค คือ จังหวัดนครนายก และจังหวัดสระบุรี', 
        address: 'เลขที่ 120 หมู่ที่ 3 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพฯ 10210', 
        telephone: 'โทรศัพท์ : 0 2141 1111 , Call Center ศาลปกครอง 1355 ', 
        date: 'เปิดทำการวันที่  9 มีนาคม 2544', 
    },
    { 
        id: 9, 
        linkUrl: '',
        linkNavigation: '',
        image: '/img/upload/map01.jpg', 
        title: 'สำนักงานศาลปกครอง', 
        desc: 'ศาลปกครองกลาง โดยมีเขตอำนาจตลอดท้องที่กรุงเทพมหานคร จังหวัดนครปฐม จังหวัดนนทบุรี จังหวัดปทุมธานีจังหวัดสมุทรปราการ และจังหวัดสมุทรสาคร รวมทั้งจังหวัดที่มิได้อยู่ในเขตอำนาจของศาลปกครองในภูมิภาค คือ จังหวัดนครนายก และจังหวัดสระบุรี', 
        address: 'เลขที่ 120 หมู่ที่ 3 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพฯ 10210', 
        telephone: 'โทรศัพท์ : 0 2141 1111 , Call Center ศาลปกครอง 1355 ', 
        date: 'เปิดทำการวันที่  9 มีนาคม 2544', 
    },
    { 
        id: 10, 
        linkUrl: '',
        linkNavigation: '',
        image: '/img/upload/map01.jpg', 
        title: 'สำนักงานศาลปกครอง', 
        desc: 'ศาลปกครองกลาง โดยมีเขตอำนาจตลอดท้องที่กรุงเทพมหานคร จังหวัดนครปฐม จังหวัดนนทบุรี จังหวัดปทุมธานีจังหวัดสมุทรปราการ และจังหวัดสมุทรสาคร รวมทั้งจังหวัดที่มิได้อยู่ในเขตอำนาจของศาลปกครองในภูมิภาค คือ จังหวัดนครนายก และจังหวัดสระบุรี', 
        address: 'เลขที่ 120 หมู่ที่ 3 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพฯ 10210', 
        telephone: 'โทรศัพท์ : 0 2141 1111 , Call Center ศาลปกครอง 1355 ', 
        date: 'เปิดทำการวันที่  9 มีนาคม 2544', 
    },
    { 
        id: 11, 
        linkUrl: '',
        linkNavigation: '',
        image: '/img/upload/map01.jpg', 
        title: 'สำนักงานศาลปกครอง', 
        desc: 'ศาลปกครองกลาง โดยมีเขตอำนาจตลอดท้องที่กรุงเทพมหานคร จังหวัดนครปฐม จังหวัดนนทบุรี จังหวัดปทุมธานีจังหวัดสมุทรปราการ และจังหวัดสมุทรสาคร รวมทั้งจังหวัดที่มิได้อยู่ในเขตอำนาจของศาลปกครองในภูมิภาค คือ จังหวัดนครนายก และจังหวัดสระบุรี', 
        address: 'เลขที่ 120 หมู่ที่ 3 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพฯ 10210', 
        telephone: 'โทรศัพท์ : 0 2141 1111 , Call Center ศาลปกครอง 1355 ', 
        date: 'เปิดทำการวันที่  9 มีนาคม 2544', 
    },
    { 
        id: 12, 
        linkUrl: '',
        linkNavigation: '',
        image: '/img/upload/map01.jpg', 
        title: 'สำนักงานศาลปกครอง', 
        desc: 'ศาลปกครองกลาง โดยมีเขตอำนาจตลอดท้องที่กรุงเทพมหานคร จังหวัดนครปฐม จังหวัดนนทบุรี จังหวัดปทุมธานีจังหวัดสมุทรปราการ และจังหวัดสมุทรสาคร รวมทั้งจังหวัดที่มิได้อยู่ในเขตอำนาจของศาลปกครองในภูมิภาค คือ จังหวัดนครนายก และจังหวัดสระบุรี', 
        address: 'เลขที่ 120 หมู่ที่ 3 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพฯ 10210', 
        telephone: 'โทรศัพท์ : 0 2141 1111 , Call Center ศาลปกครอง 1355 ', 
        date: 'เปิดทำการวันที่  9 มีนาคม 2544', 
    },
    { 
        id: 13, 
        linkUrl: '',
        linkNavigation: '',
        image: '/img/upload/map01.jpg', 
        title: 'สำนักงานศาลปกครอง', 
        desc: 'ศาลปกครองกลาง โดยมีเขตอำนาจตลอดท้องที่กรุงเทพมหานคร จังหวัดนครปฐม จังหวัดนนทบุรี จังหวัดปทุมธานีจังหวัดสมุทรปราการ และจังหวัดสมุทรสาคร รวมทั้งจังหวัดที่มิได้อยู่ในเขตอำนาจของศาลปกครองในภูมิภาค คือ จังหวัดนครนายก และจังหวัดสระบุรี', 
        address: 'เลขที่ 120 หมู่ที่ 3 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพฯ 10210', 
        telephone: 'โทรศัพท์ : 0 2141 1111 , Call Center ศาลปกครอง 1355 ', 
        date: 'เปิดทำการวันที่  9 มีนาคม 2544', 
    },
    { 
        id: 14, 
        linkUrl: '',
        linkNavigation: '',
        image: '/img/upload/map01.jpg', 
        title: 'สำนักงานศาลปกครอง', 
        desc: 'ศาลปกครองกลาง โดยมีเขตอำนาจตลอดท้องที่กรุงเทพมหานคร จังหวัดนครปฐม จังหวัดนนทบุรี จังหวัดปทุมธานีจังหวัดสมุทรปราการ และจังหวัดสมุทรสาคร รวมทั้งจังหวัดที่มิได้อยู่ในเขตอำนาจของศาลปกครองในภูมิภาค คือ จังหวัดนครนายก และจังหวัดสระบุรี', 
        address: 'เลขที่ 120 หมู่ที่ 3 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพฯ 10210', 
        telephone: 'โทรศัพท์ : 0 2141 1111 , Call Center ศาลปกครอง 1355 ', 
        date: 'เปิดทำการวันที่  9 มีนาคม 2544', 
    },
    { 
        id: 15, 
        linkUrl: '',
        linkNavigation: '',
        image: '/img/upload/map01.jpg', 
        title: 'สำนักงานศาลปกครอง', 
        desc: 'ศาลปกครองกลาง โดยมีเขตอำนาจตลอดท้องที่กรุงเทพมหานคร จังหวัดนครปฐม จังหวัดนนทบุรี จังหวัดปทุมธานีจังหวัดสมุทรปราการ และจังหวัดสมุทรสาคร รวมทั้งจังหวัดที่มิได้อยู่ในเขตอำนาจของศาลปกครองในภูมิภาค คือ จังหวัดนครนายก และจังหวัดสระบุรี', 
        address: 'เลขที่ 120 หมู่ที่ 3 ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพฯ 10210', 
        telephone: 'โทรศัพท์ : 0 2141 1111 , Call Center ศาลปกครอง 1355 ', 
        date: 'เปิดทำการวันที่  9 มีนาคม 2544', 
    },
];

export default function ContactBody() {
    return (
        <Box className="sc-body">
            <div className="sc-contact-list">
                <ul className="item-list">
                    {searchItem.map((item) => (
                        <li key={item.id}>
                            <div className="wrapper">
                                <div className={`thumb`}>
                                    <figure className="ratio ratio-1x1">
                                        <Image className="cover-img"
                                            loader={imageLoader}
                                            src={item.image}
                                            alt={item.title}
                                            width={353}
                                            height={353}
                                        />
                                    </figure>
                                </div>
                                <div className="content">
                                    <Typography variant="h3" className="title">
                                        {item.title}
                                    </Typography>
                                    <Typography variant="body1" className="desc text-limit">
                                        {item.desc}
                                    </Typography>
                                    <div className="address">
                                        <ul className="list">
                                            <li>
                                                <div className="icon">
                                                    <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                        <path d="M7.5013 14.9261L1.66797 18.2594V4.92611L7.5013 1.59277M7.5013 14.9261L13.3346 18.2594M7.5013 14.9261V1.59277M13.3346 18.2594L18.3346 14.9261V1.59277L13.3346 4.92611M13.3346 18.2594V4.92611M13.3346 4.92611L7.5013 1.59277" stroke="#B18F30" strokeWidth="1.66667" strokeLinecap="round" strokeLinejoin="round"/>
                                                    </svg>
                                                </div>
                                                <p className="txt">{item.address}</p>
                                            </li>
                                            <li>
                                                <div className="icon">
                                                    <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                        <path d="M11.7094 4.92611C12.5233 5.08491 13.2713 5.48299 13.8577 6.06939C14.4441 6.65578 14.8422 7.40383 15.001 8.21777M11.7094 1.59277C13.4004 1.78064 14.9773 2.53792 16.1812 3.74028C17.3851 4.94264 18.1444 6.51862 18.3344 8.20944M8.5235 11.4787C7.52219 10.4773 6.73153 9.34515 6.15153 8.13713C6.10164 8.03322 6.0767 7.98127 6.05753 7.91553C5.98943 7.6819 6.03835 7.39502 6.18003 7.19716C6.21989 7.14148 6.26752 7.09385 6.36278 6.99859C6.65412 6.70725 6.79979 6.56158 6.89503 6.4151C7.25419 5.86269 7.25419 5.15054 6.89503 4.59813C6.79979 4.45165 6.65412 4.30598 6.36278 4.01464L6.20039 3.85225C5.75752 3.40938 5.53609 3.18795 5.29827 3.06766C4.8253 2.82844 4.26675 2.82844 3.79378 3.06766C3.55596 3.18795 3.33453 3.40938 2.89166 3.85225L2.7603 3.98361C2.31895 4.42497 2.09827 4.64564 1.92973 4.94567C1.74271 5.27859 1.60825 5.79567 1.60938 6.17752C1.61041 6.52164 1.67716 6.75683 1.81067 7.2272C2.52814 9.75503 3.88187 12.1403 5.87185 14.1303C7.86184 16.1203 10.2471 17.474 12.775 18.1915C13.2453 18.325 13.4805 18.3918 13.8246 18.3928C14.2065 18.3939 14.7236 18.2595 15.0565 18.0724C15.3565 17.9039 15.5772 17.6832 16.0186 17.2419L16.1499 17.1105C16.5928 16.6676 16.8142 16.4462 16.9345 16.2084C17.1737 15.7354 17.1737 15.1769 16.9345 14.7039C16.8142 14.4661 16.5928 14.2446 16.1499 13.8018L15.9875 13.6394C15.6962 13.348 15.5505 13.2024 15.404 13.1071C14.8516 12.748 14.1395 12.748 13.5871 13.1071C13.4406 13.2024 13.2949 13.348 13.0036 13.6394C12.9083 13.7346 12.8607 13.7823 12.805 13.8221C12.6072 13.9638 12.3203 14.0127 12.0866 13.9446C12.0209 13.9255 11.9689 13.9005 11.865 13.8506C10.657 13.2706 9.52482 12.48 8.5235 11.4787Z" stroke="#B18F30" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/>
                                                    </svg>
                                                </div>
                                                <p className="txt">{item.telephone}</p>
                                            </li>
                                        </ul>
                                        <div className="action">
                                            <Link href={item.linkNavigation} className="link" title={`นำทาง ${item.title}`}>
                                                <span className="icon">
                                                    <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                        <path d="M7.5013 14.9261L1.66797 18.2594V4.92611L7.5013 1.59277M7.5013 14.9261L13.3346 18.2594M7.5013 14.9261V1.59277M13.3346 18.2594L18.3346 14.9261V1.59277L13.3346 4.92611M13.3346 18.2594V4.92611M13.3346 4.92611L7.5013 1.59277" stroke="#B18F30" strokeWidth="1.66667" strokeLinecap="round" strokeLinejoin="round"/>
                                                    </svg>
                                                </span>
                                                นำทาง
                                            </Link>
                                        </div>
                                    </div>
                                    <div className="info">
                                        <Link href={item.linkUrl} className="link" title={`ดูเว็บไซต์ ${item.title}`}>
                                            <span className="icon">
                                                <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <path d="M8.33448 10.7597C8.69235 11.2382 9.14894 11.6341 9.67327 11.9205C10.1976 12.207 10.7774 12.3773 11.3734 12.42C11.9693 12.4627 12.5675 12.3767 13.1273 12.1679C13.6871 11.9591 14.1954 11.6323 14.6178 11.2097L17.1178 8.70974C17.8768 7.92389 18.2968 6.87138 18.2873 5.7789C18.2778 4.68641 17.8396 3.64136 17.0671 2.86883C16.2945 2.09629 15.2495 1.65809 14.157 1.6486C13.0645 1.6391 12.012 2.05908 11.2261 2.81807L9.79281 4.24307M11.6678 9.09307C11.3099 8.61463 10.8533 8.21875 10.329 7.93229C9.80469 7.64582 9.22489 7.47547 8.62893 7.43279C8.03298 7.39011 7.43482 7.4761 6.87502 7.68492C6.31522 7.89374 5.80688 8.22051 5.38448 8.64307L2.88448 11.1431C2.12548 11.9289 1.70551 12.9814 1.715 14.0739C1.72449 15.1664 2.1627 16.2114 2.93523 16.984C3.70777 17.7565 4.75282 18.1947 5.8453 18.2042C6.93779 18.2137 7.9903 17.7937 8.77614 17.0347L10.2011 15.6097" stroke="#B18F30" strokeWidth="1.66667" strokeLinecap="round" strokeLinejoin="round"/>
                                                </svg>
                                            </span>
                                            ดูเว็บไซต์
                                        </Link>
                                        <span className="date">{item.date}</span>
                                    </div>
                                </div>
                            </div>
                        </li>
                    ))}
                </ul>
            </div>
        </Box>
    )
}