// types
import {LayoutListCategory} from "@/types/list";

export const SearchInformationCaseTypeListItem: LayoutListCategory[] = [
    { 
        id: 1, 
        txt: 'การคมนาคมและการขนส่ง',
        linkUrl: '',
    },
    { 
        id: 2, 
        txt: 'การควบคุมอาคารและการผังเมือง',
        linkUrl: '',
    },
    { 
        id: 3, 
        txt: 'การทุจริตและประพฤติมิชอบ',
        linkUrl: '',
    },
    { 
        id: 4, 
        txt: 'การปกครองและการบริหารราชการแผ่นดิน',
        linkUrl: '',
    },
    { 
        id: 5, 
        txt: 'การประกอบกิจการและเหตุเดือดร้อนรำคาญ',
        linkUrl: '',
    },
    { 
        id: 6, 
        txt: 'การพัสดุ',
        linkUrl: '',
    },
    { 
        id: 7, 
        txt: 'การเลือกตั้ง',
        linkUrl: '',
    },
    { 
        id: 8, 
        txt: 'การเวนคืนอสังหาริมทรัพย์',
        linkUrl: '',
    },
    { 
        id: 9, 
        txt: 'การศึกษา การศาสนา สังคม และวัฒนธรรม',
        linkUrl: '',
    },
    { 
        id: 10, 
        txt: 'กิจการโทรคมนาคม',
        linkUrl: '',
    },
    { 
        id: 11, 
        txt: 'ข้อมูลข่าวสารของราชการ',
        linkUrl: '',
    },
    { 
        id: 12, 
        txt: 'คดีพิพาทเกี่ยวกับสัญญาอนุญาโตตุลาการ',
        linkUrl: '',
    },
    { 
        id: 13, 
        txt: 'การบริหารงานบุคคล',
        linkUrl: '',
    },
    { 
        id: 14, 
        txt: 'การบริหารงานบุคคล(สำหรับคดีปกครองเดิม)',
        linkUrl: '',
    },
    { 
        id: 15, 
        txt: 'การพาณิชย์ การอุตสาหกรรม การเกษตรและสหกรณ์',
        linkUrl: '',
    },
    { 
        id: 16, 
        txt: 'การลงทุน การเงิน การคลังและการธนาคาร',
        linkUrl: '',
    },
    { 
        id: 17, 
        txt: 'การสาธารณสุขและอนามัย',
        linkUrl: '',
    },
    { 
        id: 18, 
        txt: 'การสาธารณูปโภค',
        linkUrl: '',
    },
    { 
        id: 19, 
        txt: 'คดีแพ่งและกระบวนการยุติธรรมทางแพ่ง',
        linkUrl: '',
    },
    { 
        id: 20, 
        txt: 'คดีวินัยการคลังและการงบประมาณ',
        linkUrl: '',
    },
    { 
        id: 21, 
        txt: 'คดีอาญาและกระบวนการยุติธรรมทางอาญา',
        linkUrl: '',
    },
    { 
        id: 22, 
        txt: 'คดีอื่นตามประกาศของประธานศาลปกครองสูงสุด',
        linkUrl: '',
    },
    { 
        id: 23, 
        txt: 'ความรับผิด',
        linkUrl: '',
    },
    { 
        id: 24, 
        txt: 'งานทะเบียน',
        linkUrl: '',
    },
    { 
        id: 25, 
        txt: 'ทรัพย์สินทางปัญญาและการค้าระหว่างประเทศ',
        linkUrl: '',
    },
    { 
        id: 26, 
        txt: 'ทรัพยากรธรรมชาติและสิ่งแวดล้อม',
        linkUrl: '',
    },
    { 
        id: 27, 
        txt: 'ที่ดิน',
        linkUrl: '',
    },
    { 
        id: 28, 
        txt: 'บำเหน็จบำนาญ',
        linkUrl: '',
    },
    { 
        id: 29, 
        txt: 'ป้องกันและปราบปรามการฟอกเงิน',
        linkUrl: '',
    },
    { 
        id: 30, 
        txt: 'ภาษีอากรและค่าธรรมเนียม',
        linkUrl: '',
    },
    { 
        id: 31, 
        txt: 'แรงงานและสวัสดิการสังคม',
        linkUrl: '',
    },
    { 
        id: 32, 
        txt: 'ล้มละลาย',
        linkUrl: '',
    },
    { 
        id: 33, 
        txt: 'ละเมิดและความรับผิดอย่างอื่น',
        linkUrl: '',
    },
    { 
        id: 34, 
        txt: 'วินัย',
        linkUrl: '',
    },
    { 
        id: 35, 
        txt: 'สัญญากับทางราชการ',
        linkUrl: '',
    },
    { 
        id: 36, 
        txt: 'สิทธิประโยชน์และสวัสดิการ',
        linkUrl: '',
    },
    { 
        id: 37, 
        txt: 'องค์กรตามรัฐธรรมนูญ',
        linkUrl: '',
    },
    { 
        id: 38, 
        txt: 'องค์กรวิชาชีพ',
        linkUrl: '',
    },
    { 
        id: 39, 
        txt: 'อื่นๆ',
        linkUrl: '',
    },
]; 