// types
import {LayoutListDownloadSearch} from "@/types/list";

export const SearchInformationStatementsListItem: LayoutListDownloadSearch[] = [
    { 
        id: 1, 
        hTitle: '61. งานคดีปกครอง คดีหมายเลขดำที่ อ. 235/2566 ,คดีหมายเลขแดงที่ อ. 225/2568', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        linkUrl: '/search-information/detail',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        infoList:[
            {
                id: 1, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },
    { 
        id: 2, 
        hTitle: '61. งานคดีปกครอง คดีหมายเลขดำที่ อ. 235/2566 ,คดีหมายเลขแดงที่ อ. 225/2568', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        linkUrl: '/search-information/detail',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        infoList:[
            {
                id: 1, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },
    { 
        id: 3, 
        hTitle: '61. งานคดีปกครอง คดีหมายเลขดำที่ อ. 235/2566 ,คดีหมายเลขแดงที่ อ. 225/2568', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        linkUrl: '/search-information/detail',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        infoList:[
            {
                id: 1, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },
    { 
        id: 4, 
        hTitle: '61. งานคดีปกครอง คดีหมายเลขดำที่ อ. 235/2566 ,คดีหมายเลขแดงที่ อ. 225/2568', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        linkUrl: '/search-information/detail',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        infoList:[
            {
                id: 1, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },
    { 
        id: 5, 
        hTitle: '61. งานคดีปกครอง คดีหมายเลขดำที่ อ. 235/2566 ,คดีหมายเลขแดงที่ อ. 225/2568', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        linkUrl: '/search-information/detail',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        infoList:[
            {
                id: 1, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },
    { 
        id: 6, 
        hTitle: '61. งานคดีปกครอง คดีหมายเลขดำที่ อ. 235/2566 ,คดีหมายเลขแดงที่ อ. 225/2568', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        linkUrl: '/search-information/detail',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        infoList:[
            {
                id: 1, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },
    { 
        id: 7, 
        hTitle: '61. งานคดีปกครอง คดีหมายเลขดำที่ อ. 235/2566 ,คดีหมายเลขแดงที่ อ. 225/2568', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        linkUrl: '/search-information/detail',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        infoList:[
            {
                id: 1, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },
    { 
        id: 8, 
        hTitle: '61. งานคดีปกครอง คดีหมายเลขดำที่ อ. 235/2566 ,คดีหมายเลขแดงที่ อ. 225/2568', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        linkUrl: '/search-information/detail',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        infoList:[
            {
                id: 1, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },
]; 