// types
import {LayoutListItem} from "@/types/list";

export const PublicRelationsProcurementListItem: LayoutListItem[] = [
    { 
        id: 1, 
        date: '10.02.2025', 
        iconType: 'pdf',
        title: 'สรุปผลการดำเนินการจัดซื้อจัดจ้างในรอบเดือนเมษายน2568ของสำนักงานศาลปกครองยะลา', 
        linkUrl: '#'
    },
    { 
        id: 2, 
        date: '10.02.2025', 
        iconType: 'pdf',
        title: 'สรุปผลการดำเนินการจัดซื้อจัดจ้างในรอบเดือนเมษายน2568ของสำนักงานศาลปกครองยะลา', 
        linkUrl: '#'
    },
    { 
        id: 3, 
        date: '10.02.2025', 
        iconType: 'pdf',
        title: 'สรุปผลการดำเนินการจัดซื้อจัดจ้างในรอบเดือนเมษายน2568ของสำนักงานศาลปกครองยะลา', 
        linkUrl: '#'
    },
    { 
        id: 4, 
        date: '10.02.2025', 
        iconType: 'pdf',
        title: 'สรุปผลการดำเนินการจัดซื้อจัดจ้างในรอบเดือนเมษายน2568ของสำนักงานศาลปกครองยะลา', 
        linkUrl: '#'
    },
    { 
        id: 5, 
        date: '10.02.2025', 
        iconType: 'pdf',
        title: 'สรุปผลการดำเนินการจัดซื้อจัดจ้างในรอบเดือนเมษายน2568ของสำนักงานศาลปกครองยะลา', 
        linkUrl: '#'
    },
    { 
        id: 6, 
        date: '10.02.2025', 
        iconType: 'pdf',
        title: 'สรุปผลการดำเนินการจัดซื้อจัดจ้างในรอบเดือนเมษายน2568ของสำนักงานศาลปกครองยะลา', 
        linkUrl: '#'
    },
    { 
        id: 7, 
        date: '10.02.2025', 
        iconType: 'pdf',
        title: 'สรุปผลการดำเนินการจัดซื้อจัดจ้างในรอบเดือนเมษายน2568ของสำนักงานศาลปกครองยะลา', 
        linkUrl: '#'
    },
    { 
        id: 8, 
        date: '10.02.2025', 
        iconType: 'pdf',
        title: 'สรุปผลการดำเนินการจัดซื้อจัดจ้างในรอบเดือนเมษายน2568ของสำนักงานศาลปกครองยะลา', 
        linkUrl: '#'
    },
    { 
        id: 9, 
        date: '10.02.2025', 
        iconType: 'pdf',
        title: 'สรุปผลการดำเนินการจัดซื้อจัดจ้างในรอบเดือนเมษายน2568ของสำนักงานศาลปกครองยะลา', 
        linkUrl: '#'
    },
    { 
        id: 10, 
        date: '10.02.2025', 
        iconType: 'pdf',
        title: 'สรุปผลการดำเนินการจัดซื้อจัดจ้างในรอบเดือนเมษายน2568ของสำนักงานศาลปกครองยะลา', 
        linkUrl: '#'
    },
]; 