// types
import {LayoutListItemSlide} from "@/types/list";

export const OfficeCultureListItem: LayoutListItemSlide[] = [
    { 
        id: 1, 
        hTitle: 'บทความเพื่อขับเคลื่อน TRUST ของศาลปกครองให้สำเร็จ', 
        itemSlide:[
            {
                id: 1, 
                date: '10.02.2025', 
                image: '/img/upload/infomation.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 2, 
                date: '10.02.2025', 
                image: '/img/upload/infomation.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
        ]
    },
    { 
        id: 2, 
        hTitle: 'กิจกรรม Share & Learning', 
        itemSlide:[
            {
                id: 1, 
                date: '10.02.2025', 
                image: '/img/upload/info-graphic.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 2, 
                date: '10.02.2025', 
                image: '/img/upload/info-graphic.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 3, 
                date: '10.02.2025', 
                image: '/img/upload/info-graphic.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 4, 
                date: '10.02.2025', 
                image: '/img/upload/info-graphic.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 5, 
                date: '10.02.2025', 
                image: '/img/upload/info-graphic.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 6, 
                date: '10.02.2025', 
                image: '/img/upload/info-graphic.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
        ]
    },
    { 
        id: 3, 
        hTitle: 'การเสริมสร้างวัฒนธรรมองค์กร', 
        itemSlide:[
            {
                id: 1, 
                date: '10.02.2025', 
                image: '/img/upload/news-book.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 2, 
                date: '10.02.2025', 
                image: '/img/upload/news-book.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 3, 
                date: '10.02.2025', 
                image: '/img/upload/news-book.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
        ]
    },
    { 
        id: 4, 
        hTitle: 'กิจกรรมยกย่องเชิดชูบุคลากรศาลปกครองผู้ทำความดีและมีจิตอาสาเพื่อสาธารณะประโยชน์e & Learning', 
        itemSlide:[
            {
                id: 1, 
                date: '10.02.2025', 
                image: '/img/upload/news.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
        ]
    },
]; 