// types
import {LayoutListDownloadSearch} from "@/types/list";

export const SearchInformationLitigationListItem: LayoutListDownloadSearch[] = [
    { 
        id: 1, 
        hTitle: '1144/2568 ยังไม่ออกคดีหมายเลขแดง', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        infoList:[
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '3 ธันวาคม 2551', 
            },
            {
                id: 2, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 3, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 4, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },
    { 
        id: 2, 
        hTitle: '1144/2568 ยังไม่ออกคดีหมายเลขแดง', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        infoList:[
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '3 ธันวาคม 2551', 
            },
            {
                id: 2, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 3, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 4, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },
    { 
        id: 3, 
        hTitle: '1144/2568 ยังไม่ออกคดีหมายเลขแดง', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        infoList:[
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '3 ธันวาคม 2551', 
            },
            {
                id: 2, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 3, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 4, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },
    { 
        id: 4, 
        hTitle: '1144/2568 ยังไม่ออกคดีหมายเลขแดง', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        infoList:[
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '3 ธันวาคม 2551', 
            },
            {
                id: 2, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 3, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 4, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },
    { 
        id: 5, 
        hTitle: '1144/2568 ยังไม่ออกคดีหมายเลขแดง', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        infoList:[
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '3 ธันวาคม 2551', 
            },
            {
                id: 2, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 3, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 4, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },{ 
        id: 6, 
        hTitle: '1144/2568 ยังไม่ออกคดีหมายเลขแดง', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        infoList:[
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '3 ธันวาคม 2551', 
            },
            {
                id: 2, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 3, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 4, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },
    { 
        id: 7, 
        hTitle: '1144/2568 ยังไม่ออกคดีหมายเลขแดง', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        infoList:[
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '3 ธันวาคม 2551', 
            },
            {
                id: 2, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 3, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 4, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },
    { 
        id: 8, 
        hTitle: '1144/2568 ยังไม่ออกคดีหมายเลขแดง', 
        tagBlack: 'อ. 235/2566', 
        tagRed: 'อ. 225/2568', 
        infoList:[
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '3 ธันวาคม 2551', 
            },
            {
                id: 2, 
                title: 'ผู้ฟ้อง', 
                desc: 'นางอรพรรณ พัฒนศรี', 
            },
            {
                id: 3, 
                title: 'ผู้ถูกฟ้อง', 
                desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานี กับพวกรวม 4 คน', 
            },
            {
                id: 4, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย', 
            },
        ]
    },
]; 