// types
import {LayoutListItem} from "@/types/list";

export const PublicRelationsNewsListItem: LayoutListItem[] = [
    { 
        id: 1, 
        date: '10.02.2025', 
        image: '/img/upload/news.jpg', 
        title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
        linkUrl: '/public-relations/detail'
    },
    { 
        id: 2, 
        date: '10.02.2025', 
        image: '/img/upload/news.jpg', 
        title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
        linkUrl: '/public-relations/detail'
    },
    { 
        id: 3, 
        date: '10.02.2025', 
        image: '/img/upload/news.jpg', 
        title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
        linkUrl: '/public-relations/detail'
    },
    { 
        id: 4, 
        date: '10.02.2025', 
        image: '/img/upload/news.jpg', 
        title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
        linkUrl: '/public-relations/detail'
    },
    { 
        id: 5, 
        date: '10.02.2025', 
        image: '/img/upload/news.jpg', 
        title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
        linkUrl: '/public-relations/detail'
    },
    { 
        id: 6, 
        date: '10.02.2025', 
        image: '/img/upload/news.jpg', 
        title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
        linkUrl: '/public-relations/detail'
    },
    { 
        id: 7, 
        date: '10.02.2025', 
        image: '/img/upload/news.jpg', 
        title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
        linkUrl: '/public-relations/detail'
    },
    { 
        id: 8, 
        date: '10.02.2025', 
        image: '/img/upload/news.jpg', 
        title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
        linkUrl: '/public-relations/detail'
    },
    { 
        id: 9, 
        date: '10.02.2025', 
        image: '/img/upload/news.jpg', 
        title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
        linkUrl: '/public-relations/detail'
    },
    { 
        id: 10, 
        date: '10.02.2025', 
        image: '/img/upload/news.jpg', 
        title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
        linkUrl: '/public-relations/detail'
    },
    { 
        id: 11, 
        date: '10.02.2025', 
        image: '/img/upload/news.jpg', 
        title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
        linkUrl: '/public-relations/detail'
    },
    { 
        id: 12, 
        date: '10.02.2025', 
        image: '/img/upload/news.jpg', 
        title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
        linkUrl: '/public-relations/detail'
    },
]; 