// types
import {detailCMS} from "@/types/detail";

export const PublicRelationsDetailCMS: detailCMS = {
    id: 1,
    text: 
    <>
        <p>สำนักงานศาลปกครอง จัดการสัมมนาเพื่อประเมินผลการดำเนินงานในภาพรวมของศาลปกครอง ประจำปีงบประมาณ พ.ศ. 2568 หัวข้อ “การดำเนินกระบวนพิจารณาคดีด้วยวิธีการทางอิเล็กทรอนิกส์ : ปัญหา อุปสรรค และแนวทางแก้ไข” ระหว่างวันที่ 16 พฤษภาคม 2568  ถึงวันที่ 18 พฤษภาคม 2568 ณ ห้องแกรนด์บอลรูม ชั้น 4 โรงแรมมิราเคิล แกรนด์ คอนเวนชั่น กรุงเทพฯ โดยได้รับเกียรติจาก นายประสิทธิ์ศักดิ์  มีลาภ ประธานศาลปกครองสูงสุด กล่าวเปิดการสัมมนาและมอบนโยบายเกี่ยวกับการดำเนินกระบวนพิจารณาคดีด้วยวิธีการทางอิเล็กทรอนิกส์ และนายจำนงค์  ถาวรวิสิทธิ์ เลขาธิการสำนักงานศาลปกครอง กล่าวรายงาน โดยมีผู้เข้าร่วมการสัมมนา ประกอบด้วย ผู้บริหารศาลปกครองสูงสุด คณะตุลาการในศาลปกครองสูงสุดและตุลาการในศาลปกครองชั้นต้นทั้งในส่วนกลางและในภูมิภาค ผู้บริหาร และบุคลากรสำนักงานศาลปกครอง รวมจำนวน 270 คน</p>
        <p>
            <strong>สำหรับกิจกรรมการสัมมนาฯ ประกอบด้วย</strong><br />
            วันเสาร์ที่ 17 พฤษภาคม 2568 เวลา 09.00 - 09.30 น. เลขาธิการสำนักงานศาลปกครอง กล่าวรายงาน และประธานศาลปกครองสูงสุด กล่าวเปิดการสัมมนา และมอบนโยบายเกี่ยวกับการดำเนินกระบวนพิจารณาคดีด้วยวิธีการทางอิเล็กทรอนิกส์ 
        </p>
        <p>ต่อมาได้มีการชี้แจงประเด็นการสัมมนา โดยนายเอกณัฐ จิณเสน ตุลาการหัวหน้าคณะศาลปกครองชั้นต้นประจำศาลปกครองสูงสุด นางจักราวดี  มนูญพงศ์  ตุลาการหัวหน้าคณะศาลปกครองกลาง และนางนาถอุมา บรรจงมณี ตุลาการศาลปกครองนครสวรรค์ </p>
        <p>โดยในภายหลังได้มีการแบ่งกลุ่มสัมมนาปัญหาการดำเนินกระบวนพิจารณาคดีด้วยระบบอิเล็กทรอนิกส์ : ปัญหาการพิจารณาคดีและการตีความตามกฎหมายวิธีพิจารณาคดีปกครอง และปัญหาในทางปฏิบัติที่ส่งผลต่อการพิจารณาคดี โดยเป็นประเด็นปัญหาที่ได้รวบรวมมาจากตุลาการศาลปกครองและพนักงานคดีปกครองประจำองค์คณะศาลปกครองสูงสุดและศาลปกครองชั้นต้นทั่วประเทศ นำมากำหนดเป็นประเด็นการสัมมนากลุ่มย่อย และแบ่งผู้เข้าร่วมสัมมนาออกเป็น 10 กลุ่ม โดยมีผู้แทนตุลาการในศาลปกครองสูงสุด เป็นประธานกลุ่ม ผู้แทนตุลาการในศาลปกครองชั้นต้น เป็นเลขานุการกลุ่ม และมีบุคลากรสำนักงานศาลปกครอง เป็นเจ้าหน้าที่ประจำกลุ่ม ร่วมกันวิเคราะห์ประเด็นปัญหา แลกเปลี่ยนความคิดเห็น ความรู้และประสบการณ์ และวางแนวทางการแก้ไขปัญหาในประเด็นดังกล่าว</p>
        <p>วันอาทิตย์ที่ 18  พฤษภาคม 2568 เป็นการนำเสนอผลการสัมมนาและแลกเปลี่ยนความคิดเห็นของกลุ่มย่อย โดยผู้แทนแต่ละกลุ่ม และผู้บริหารศาลปกครองสูงสุด ประกอบด้วย นายประสิทธิ์ศักดิ์  มีลาภ ประธานศาลปกครองสูงสุด นายสุชาติ  มงคลเลิศลพ และนายพรชัย  มนัสศิริเพ็ญ รองประธานศาลปกครองสูงสุด ร่วมรับฟังสรุปผลการสัมมนาและให้ข้อคิดเห็น เพื่อนำผลการสัมมนาไปใช้เป็นข้อมูลประกอบการพัฒนากระบวนการพิจารณาคดีด้วยวิธีการทางอิเล็กทรอนิกส์ ซึ่งจะส่งผลต่อการยกระดับการให้บริการด้านความยุติธรรมทางปกครองด้วยระบบศาลปกครองอิเล็กทรอนิกส์ (e-Admincourt) ต่อไป</p>
        <p>ข่าวและภาพข่าว : วิทยาลัยตุลาการและข้าราชการฝ่ายศาลปกครอง</p>
        <p>เผยแพร่ข่าว : สำนักประชาสัมพันธ์</p>
    </>,
};