// types
import {detailInformation} from "@/types/detail";

export const SearchInformationDetailInformation: detailInformation = {
    id: 1,
    title: 'งานคดีปกครอง คดีหมายเลขดำที่ อ. 235/2566 ,คดีหมายเลขแดงที่ อ. 225/2568',
    tagBlack: 'คดีหมายเลขดำที่ อ. 235/2566',
    tagRed: 'คดีหมายเลขแดงที่ อ. 225/2568',
    dataList: [
        {
            id: 1,
            title: 'ศาลปกครอง',
            desc: 'ศาลปกครองสูงสุด',
        },
        {
            id: 2,
            title: 'แผนกคดี',
            desc: '',
        },
        {
            id: 3,
            title: 'วันที่รับคำฟ้อง',
            desc: '13 กุมภาพันธ์ 2566',
        },
        {
            id: 4,
            title: 'ผู้ฟ้องคดี',
            desc: 'นางอรพรรณ พัฒนศรี',
        },
        {
            id: 5,
            title: 'ผู้ถูกฟ้องคดี',
            desc: 'สำนักงานเจ้าท่าภูมิภาคสาขาสุราษฎร์ธานีกับพวกรวม 4 คน',
        },
        {
            id: 6,
            title: 'เรื่องตามกรณีข้อพิพาท',
            desc: 'คดีพิพาทเกี่ยวกับการที่หน่วยงานทางปกครองหรือเจ้าหน้าที่ของรัฐออกคำสั่งโดยไม่ชอบด้วยกฎหมาย',
        },
    ],
};