// types
import {LayoutListDownloadTable} from "@/types/list";

export const PublicRelationsAnnouncementsAuctionListItem: LayoutListDownloadTable[] = [
    { 
        id: 1, 
        hTitle: 'ศาลปกครองสูงสุด', 
        hNumber: '891/2560', 
        linkUrl: '/public-relations/viewpdf',
        btnUrl: '',
        boxList:[
            {
                id: 1, 
                title: 'ผู้ฟ้องคดี', 
                desc: 'กระทรวงกลาโหม', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้องคดี', 
                desc: 'เรืออากาศโท ยศวัฒน์ หรือสมภพ สุดตา หรือสุวิจักร พงศ์พานภักดี กับพวกรวม 2 คน', 
            },
            {
                id: 3, 
                title: 'ทรัพย์ที่ขายทอดตลาด', 
                desc: 'หุ้นสามัญ ของ บริษัท เดอะ เซเว่นท์เดย์ จำกัด เลขหมายใบหุ้น 0000001 – 0168675 ของผู้ถูกฟ้องคดีที่ 1 จำนวน 168,675 หุ้น', 
            },
            {
                id: 4, 
                title: 'ราคาประเมินทรัพย์', 
                desc: '16,867,500 บาท', 
            },
            {
                id: 5, 
                title: 'สถานที่ทำการขายทอดตลาด', 
                desc: 'ห้องสัมมนา 2 (แนวลาด) ชั้น B1 สำนักงานศาลปกครอง เวลา 10.00 นาฬิกา', 
            },
        ]
    },
    { 
        id: 2, 
        hTitle: 'ศาลปกครองสูงสุด', 
        hNumber: '891/2560', 
        linkUrl: '/public-relations/viewpdf',
        btnUrl: '',
        boxList:[
            {
                id: 1, 
                title: 'ผู้ฟ้องคดี', 
                desc: 'กระทรวงกลาโหม', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้องคดี', 
                desc: 'เรืออากาศโท ยศวัฒน์ หรือสมภพ สุดตา หรือสุวิจักร พงศ์พานภักดี กับพวกรวม 2 คน', 
            },
            {
                id: 3, 
                title: 'ทรัพย์ที่ขายทอดตลาด', 
                desc: 'หุ้นสามัญ ของ บริษัท เดอะ เซเว่นท์เดย์ จำกัด เลขหมายใบหุ้น 0000001 – 0168675 ของผู้ถูกฟ้องคดีที่ 1 จำนวน 168,675 หุ้น', 
            },
            {
                id: 4, 
                title: 'ราคาประเมินทรัพย์', 
                desc: '16,867,500 บาท', 
            },
            {
                id: 5, 
                title: 'สถานที่ทำการขายทอดตลาด', 
                desc: 'ห้องสัมมนา 2 (แนวลาด) ชั้น B1 สำนักงานศาลปกครอง เวลา 10.00 นาฬิกา', 
            },
        ]
    },
    { 
        id: 3, 
        hTitle: 'ศาลปกครองสูงสุด', 
        hNumber: '891/2560', 
        linkUrl: '/public-relations/viewpdf',
        btnUrl: '',
        boxList:[
            {
                id: 1, 
                title: 'ผู้ฟ้องคดี', 
                desc: 'กระทรวงกลาโหม', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้องคดี', 
                desc: 'เรืออากาศโท ยศวัฒน์ หรือสมภพ สุดตา หรือสุวิจักร พงศ์พานภักดี กับพวกรวม 2 คน', 
            },
            {
                id: 3, 
                title: 'ทรัพย์ที่ขายทอดตลาด', 
                desc: 'หุ้นสามัญ ของ บริษัท เดอะ เซเว่นท์เดย์ จำกัด เลขหมายใบหุ้น 0000001 – 0168675 ของผู้ถูกฟ้องคดีที่ 1 จำนวน 168,675 หุ้น', 
            },
            {
                id: 4, 
                title: 'ราคาประเมินทรัพย์', 
                desc: '16,867,500 บาท', 
            },
            {
                id: 5, 
                title: 'สถานที่ทำการขายทอดตลาด', 
                desc: 'ห้องสัมมนา 2 (แนวลาด) ชั้น B1 สำนักงานศาลปกครอง เวลา 10.00 นาฬิกา', 
            },
        ]
    },
    { 
        id: 4, 
        hTitle: 'ศาลปกครองสูงสุด', 
        hNumber: '891/2560', 
        linkUrl: '/public-relations/viewpdf',
        btnUrl: '',
        boxList:[
            {
                id: 1, 
                title: 'ผู้ฟ้องคดี', 
                desc: 'กระทรวงกลาโหม', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้องคดี', 
                desc: 'เรืออากาศโท ยศวัฒน์ หรือสมภพ สุดตา หรือสุวิจักร พงศ์พานภักดี กับพวกรวม 2 คน', 
            },
            {
                id: 3, 
                title: 'ทรัพย์ที่ขายทอดตลาด', 
                desc: 'หุ้นสามัญ ของ บริษัท เดอะ เซเว่นท์เดย์ จำกัด เลขหมายใบหุ้น 0000001 – 0168675 ของผู้ถูกฟ้องคดีที่ 1 จำนวน 168,675 หุ้น', 
            },
            {
                id: 4, 
                title: 'ราคาประเมินทรัพย์', 
                desc: '16,867,500 บาท', 
            },
            {
                id: 5, 
                title: 'สถานที่ทำการขายทอดตลาด', 
                desc: 'ห้องสัมมนา 2 (แนวลาด) ชั้น B1 สำนักงานศาลปกครอง เวลา 10.00 นาฬิกา', 
            },
        ]
    },
    { 
        id: 5, 
        hTitle: 'ศาลปกครองสูงสุด', 
        hNumber: '891/2560', 
        linkUrl: '/public-relations/viewpdf',
        btnUrl: '',
        boxList:[
            {
                id: 1, 
                title: 'ผู้ฟ้องคดี', 
                desc: 'กระทรวงกลาโหม', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้องคดี', 
                desc: 'เรืออากาศโท ยศวัฒน์ หรือสมภพ สุดตา หรือสุวิจักร พงศ์พานภักดี กับพวกรวม 2 คน', 
            },
            {
                id: 3, 
                title: 'ทรัพย์ที่ขายทอดตลาด', 
                desc: 'หุ้นสามัญ ของ บริษัท เดอะ เซเว่นท์เดย์ จำกัด เลขหมายใบหุ้น 0000001 – 0168675 ของผู้ถูกฟ้องคดีที่ 1 จำนวน 168,675 หุ้น', 
            },
            {
                id: 4, 
                title: 'ราคาประเมินทรัพย์', 
                desc: '16,867,500 บาท', 
            },
            {
                id: 5, 
                title: 'สถานที่ทำการขายทอดตลาด', 
                desc: 'ห้องสัมมนา 2 (แนวลาด) ชั้น B1 สำนักงานศาลปกครอง เวลา 10.00 นาฬิกา', 
            },
        ]
    },
    { 
        id: 6, 
        hTitle: 'ศาลปกครองสูงสุด', 
        hNumber: '891/2560', 
        linkUrl: '/public-relations/viewpdf',
        btnUrl: '',
        boxList:[
            {
                id: 1, 
                title: 'ผู้ฟ้องคดี', 
                desc: 'กระทรวงกลาโหม', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้องคดี', 
                desc: 'เรืออากาศโท ยศวัฒน์ หรือสมภพ สุดตา หรือสุวิจักร พงศ์พานภักดี กับพวกรวม 2 คน', 
            },
            {
                id: 3, 
                title: 'ทรัพย์ที่ขายทอดตลาด', 
                desc: 'หุ้นสามัญ ของ บริษัท เดอะ เซเว่นท์เดย์ จำกัด เลขหมายใบหุ้น 0000001 – 0168675 ของผู้ถูกฟ้องคดีที่ 1 จำนวน 168,675 หุ้น', 
            },
            {
                id: 4, 
                title: 'ราคาประเมินทรัพย์', 
                desc: '16,867,500 บาท', 
            },
            {
                id: 5, 
                title: 'สถานที่ทำการขายทอดตลาด', 
                desc: 'ห้องสัมมนา 2 (แนวลาด) ชั้น B1 สำนักงานศาลปกครอง เวลา 10.00 นาฬิกา', 
            },
        ]
    },
    { 
        id: 7, 
        hTitle: 'ศาลปกครองสูงสุด', 
        hNumber: '891/2560', 
        linkUrl: '/public-relations/viewpdf',
        btnUrl: '',
        boxList:[
            {
                id: 1, 
                title: 'ผู้ฟ้องคดี', 
                desc: 'กระทรวงกลาโหม', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้องคดี', 
                desc: 'เรืออากาศโท ยศวัฒน์ หรือสมภพ สุดตา หรือสุวิจักร พงศ์พานภักดี กับพวกรวม 2 คน', 
            },
            {
                id: 3, 
                title: 'ทรัพย์ที่ขายทอดตลาด', 
                desc: 'หุ้นสามัญ ของ บริษัท เดอะ เซเว่นท์เดย์ จำกัด เลขหมายใบหุ้น 0000001 – 0168675 ของผู้ถูกฟ้องคดีที่ 1 จำนวน 168,675 หุ้น', 
            },
            {
                id: 4, 
                title: 'ราคาประเมินทรัพย์', 
                desc: '16,867,500 บาท', 
            },
            {
                id: 5, 
                title: 'สถานที่ทำการขายทอดตลาด', 
                desc: 'ห้องสัมมนา 2 (แนวลาด) ชั้น B1 สำนักงานศาลปกครอง เวลา 10.00 นาฬิกา', 
            },
        ]
    },
    { 
        id: 8, 
        hTitle: 'ศาลปกครองสูงสุด', 
        hNumber: '891/2560', 
        linkUrl: '/public-relations/viewpdf',
        btnUrl: '',
        boxList:[
            {
                id: 1, 
                title: 'ผู้ฟ้องคดี', 
                desc: 'กระทรวงกลาโหม', 
            },
            {
                id: 2, 
                title: 'ผู้ถูกฟ้องคดี', 
                desc: 'เรืออากาศโท ยศวัฒน์ หรือสมภพ สุดตา หรือสุวิจักร พงศ์พานภักดี กับพวกรวม 2 คน', 
            },
            {
                id: 3, 
                title: 'ทรัพย์ที่ขายทอดตลาด', 
                desc: 'หุ้นสามัญ ของ บริษัท เดอะ เซเว่นท์เดย์ จำกัด เลขหมายใบหุ้น 0000001 – 0168675 ของผู้ถูกฟ้องคดีที่ 1 จำนวน 168,675 หุ้น', 
            },
            {
                id: 4, 
                title: 'ราคาประเมินทรัพย์', 
                desc: '16,867,500 บาท', 
            },
            {
                id: 5, 
                title: 'สถานที่ทำการขายทอดตลาด', 
                desc: 'ห้องสัมมนา 2 (แนวลาด) ชั้น B1 สำนักงานศาลปกครอง เวลา 10.00 นาฬิกา', 
            },
        ]
    },
]; 