// types
import {detailCMS} from "@/types/detail";

export const ServiceManualDetailCMS: detailCMS = {
    id: 1,
    text: 
    <>
        <div style={{ textAlign: 'center' }}>
            <h2 className="h1 text-primary"><strong>คู่มือการดำเนินคดีปกครองทางอิเล็กทรอนิกส์ "สำหรับประชาชน"</strong></h2>
            <p>
                สำนักงานศาลปกครองได้จัดทำคู่มือการดำเนินคดีปกครองทางอิเล็กทรอนิกส์ "สำหรับประชาชน" <br />
                โดยได้จำแนกเนื้อหาและวิธีการใช้งานของระบบงานคดีปกครองอิเล็กทรอนิกส์ (e-Litigation Portal) ออกเป็นส่วนต่าง ๆ ตามขั้นตอนและกระบวนการพิจารณาคดีปกครอง <br />
                ตลอดจนการใช้งานระบบกำหนดระยะเวลาดำเนินงานคดีปกครอง อันจะเป็นประโยชน์ต่อผู้ที่ประสงค์จะดำเนินคดีผ่านระบบงานคดีปกครองอิเล็กทรอนิกส์ ผู้ใช้งานระบบฯ และผู้ที่สนใจต่อไป
            </p>
        </div>
    </>,
};