"use client";

import React from 'react';
import Image from 'next/image';
import Link from "next/link";

import Typography from '@mui/material/Typography';

// scss
import "@/assets/scss/components/_breadcrumb.scss";

// libs
import {imageLoader} from "@/libs/imageLoader";

interface searchItem {
    id: number;
    linkUrl: string;
    image?: string;
    title: string;
    desc: string;
    tag: string;
}
const searchItem: searchItem[] = [
    { 
        id: 1, 
        linkUrl: '/public-relations/detail',
        image: '/img/upload/news.jpg', 
        title: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        desc: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        tag: 'ข่าวเด่น/มติ ก.ศป', 
    },
    { 
        id: 2, 
        linkUrl: '/public-relations/detail',
        image: '', 
        title: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        desc: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        tag: 'ข่าวเด่น/มติ ก.ศป', 
    },
    { 
        id: 3, 
        linkUrl: '/public-relations/detail',
        image: '', 
        title: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        desc: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        tag: 'ข่าวเด่น/มติ ก.ศป', 
    },
    { 
        id: 4, 
        linkUrl: '/public-relations/detail',
        image: '/img/upload/news.jpg', 
        title: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        desc: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        tag: 'ข่าวเด่น/มติ ก.ศป', 
    },
    { 
        id: 5, 
        linkUrl: '/public-relations/detail',
        image: '', 
        title: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        desc: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        tag: 'ข่าวเด่น/มติ ก.ศป', 
    },
    { 
        id: 6, 
        linkUrl: '/public-relations/detail',
        image: '/img/upload/news.jpg', 
        title: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        desc: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        tag: 'ข่าวเด่น/มติ ก.ศป', 
    },
    { 
        id: 7, 
        linkUrl: '/public-relations/detail',
        image: '', 
        title: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        desc: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        tag: 'ข่าวเด่น/มติ ก.ศป', 
    },
    { 
        id: 8, 
        linkUrl: '/public-relations/detail',
        image: '', 
        title: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        desc: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        tag: 'ข่าวเด่น/มติ ก.ศป', 
    },
    { 
        id: 9, 
        linkUrl: '/public-relations/detail',
        image: '/img/upload/news.jpg', 
        title: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        desc: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        tag: 'ข่าวเด่น/มติ ก.ศป', 
    },
    { 
        id: 10, 
        linkUrl: '/public-relations/detail',
        image: '', 
        title: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        desc: 'ศาลปกครองสูงสุดมีคำพิพากษาคดีฟ้องขอให้เพิกถอนคำสั่งให้ชดใช้ค่าสินไหมทดแทนโครงการรับจำนำข้าวเปลือก และเพิกถอนคำสั่งยึด อายัดทรัพย์สิน รวมทั้งคำสั่งขายทอดตลาด และคำสั่งปฏิเสธคำขอกันส่วนในฐานะเจ้าของร่วม', 
        tag: 'ข่าวเด่น/มติ ก.ศป', 
    },
];
export default function SearchItem() {
    return (
        <div className="sc-search-list">
            <ul className="item-list">
                {searchItem.map((item) => (
                    <li key={item.id}>
                        <Link href={item.linkUrl} className="link" title={item.title}>
                            {item.image && (
                                <div className={`thumb`}>
                                    <figure className="ratio ratio-3x2">
                                        <Image className="cover-img"
                                            loader={imageLoader}
                                            src={item.image}
                                            alt={item.title}
                                            width={420}
                                            height={292}
                                        />
                                    </figure>
                                </div>
                            )}
                            <div className="content">
                                <span className="date">10.02.2025</span>
                                <Typography variant="h3" className="title text-limit">
                                    {item.title}
                                </Typography>
                                <Typography variant="body1" className="desc text-limit">
                                    {item.desc}
                                </Typography>
                                <div className="tag-list">
                                    <span className="item">
                                        {item.tag}
                                    </span>
                                </div>
                            </div>
                        </Link>
                    </li>
                ))}
            </ul>
        </div>
    )
}