// types
import {LayoutListAccordion} from "@/types/list";

export const AdmincourtThingsToKnowLitigationListItemList: LayoutListAccordion[] = [
    { 
        id: 1, 
        status: 'open', 
        title: 'การฟ้องคดีปกครอง', 
        desc: <>
            <p>เนื่องจากคดีปกครองมีลักษณะพิเศษต่างไปจากคดีแพ่งและคดีอาญา ดังนั้น จึงต้องมีวิธีพิจารณาที่เหมาะสมกับสภาพของคดีปกครองเอง ซึ่งได้แก่วิธีพิจารณาแบบไต่สวน อันเป็นวิธีการที่มีหลักสำคัญในการให้อำนาจศาลในการแสวงหาข้อเท็จจริงได้ อย่างกว้างขวาง และเป็นผู้ดำเนินกระบวนพิจารณาเอง</p>
            <p>อย่างไรก็ดี การพิจารณาคดีปกครองยังคงต้องเคารพหลักทั่วไปของระบบวิธีพิจารณาคดี อันเป็นหลักการที่มุ่งเน้นให้มีการพิจารณาคดีอย่างยุติธรรมและมีประสิทธิภาพ เช่น การฟังความสองฝ่าย การพิจารณาไปตามกรอบของคำฟ้องและคำขอท้ายฟ้อง การคัดค้านตุลาการ เป็นต้น จากหลักการของกระบวนพิจารณาคดีปกครองดังกล่าวข้างต้น ได้นำมาสู่การวางระบบวิธีพิจารณาคดีปกครองที่ส่วนหนึ่งอันเป็นกรอบสาระสำคัญ ได้บัญญัติไว้ในพระราชบัญญัติจัดตั้งศาลปกครองและวิธีพิจารณาคดีปกครอง พ.ศ. 2542 และอีกส่วนหนึ่งกำหนดไว้ในระเบียบของที่ประชุมใหญ่ตุลาการในศาลปกครองสูงสุด ว่าด้วยวิธีพิจารณาคดีปกครอง พ.ศ. 2543</p>
        </>,
    },
    { 
        id: 2, 
        status: '', 
        title: 'การเสนอคำฟ้อง', 
        desc: <>
            <p>เนื่องจากคดีปกครองมีลักษณะพิเศษต่างไปจากคดีแพ่งและคดีอาญา ดังนั้น จึงต้องมีวิธีพิจารณาที่เหมาะสมกับสภาพของคดีปกครองเอง ซึ่งได้แก่วิธีพิจารณาแบบไต่สวน อันเป็นวิธีการที่มีหลักสำคัญในการให้อำนาจศาลในการแสวงหาข้อเท็จจริงได้ อย่างกว้างขวาง และเป็นผู้ดำเนินกระบวนพิจารณาเอง</p>
            <p>อย่างไรก็ดี การพิจารณาคดีปกครองยังคงต้องเคารพหลักทั่วไปของระบบวิธีพิจารณาคดี อันเป็นหลักการที่มุ่งเน้นให้มีการพิจารณาคดีอย่างยุติธรรมและมีประสิทธิภาพ เช่น การฟังความสองฝ่าย การพิจารณาไปตามกรอบของคำฟ้องและคำขอท้ายฟ้อง การคัดค้านตุลาการ เป็นต้น จากหลักการของกระบวนพิจารณาคดีปกครองดังกล่าวข้างต้น ได้นำมาสู่การวางระบบวิธีพิจารณาคดีปกครองที่ส่วนหนึ่งอันเป็นกรอบสาระสำคัญ ได้บัญญัติไว้ในพระราชบัญญัติจัดตั้งศาลปกครองและวิธีพิจารณาคดีปกครอง พ.ศ. 2542 และอีกส่วนหนึ่งกำหนดไว้ในระเบียบของที่ประชุมใหญ่ตุลาการในศาลปกครองสูงสุด ว่าด้วยวิธีพิจารณาคดีปกครอง พ.ศ. 2543</p>
        </>,
    },
    { 
        id: 3, 
        status: '', 
        title: 'ตัวอย่างการยื่นฟ้องคดีต่อศาลปกครองกลาง', 
        desc: <>
            <p>เนื่องจากคดีปกครองมีลักษณะพิเศษต่างไปจากคดีแพ่งและคดีอาญา ดังนั้น จึงต้องมีวิธีพิจารณาที่เหมาะสมกับสภาพของคดีปกครองเอง ซึ่งได้แก่วิธีพิจารณาแบบไต่สวน อันเป็นวิธีการที่มีหลักสำคัญในการให้อำนาจศาลในการแสวงหาข้อเท็จจริงได้ อย่างกว้างขวาง และเป็นผู้ดำเนินกระบวนพิจารณาเอง</p>
            <p>อย่างไรก็ดี การพิจารณาคดีปกครองยังคงต้องเคารพหลักทั่วไปของระบบวิธีพิจารณาคดี อันเป็นหลักการที่มุ่งเน้นให้มีการพิจารณาคดีอย่างยุติธรรมและมีประสิทธิภาพ เช่น การฟังความสองฝ่าย การพิจารณาไปตามกรอบของคำฟ้องและคำขอท้ายฟ้อง การคัดค้านตุลาการ เป็นต้น จากหลักการของกระบวนพิจารณาคดีปกครองดังกล่าวข้างต้น ได้นำมาสู่การวางระบบวิธีพิจารณาคดีปกครองที่ส่วนหนึ่งอันเป็นกรอบสาระสำคัญ ได้บัญญัติไว้ในพระราชบัญญัติจัดตั้งศาลปกครองและวิธีพิจารณาคดีปกครอง พ.ศ. 2542 และอีกส่วนหนึ่งกำหนดไว้ในระเบียบของที่ประชุมใหญ่ตุลาการในศาลปกครองสูงสุด ว่าด้วยวิธีพิจารณาคดีปกครอง พ.ศ. 2543</p>
        </>,
    },
    { 
        id: 4, 
        status: '', 
        title: 'ตัวอย่างคดีที่ฟ้องต่อศาลปกครองได้', 
        desc: <>
            <p>เนื่องจากคดีปกครองมีลักษณะพิเศษต่างไปจากคดีแพ่งและคดีอาญา ดังนั้น จึงต้องมีวิธีพิจารณาที่เหมาะสมกับสภาพของคดีปกครองเอง ซึ่งได้แก่วิธีพิจารณาแบบไต่สวน อันเป็นวิธีการที่มีหลักสำคัญในการให้อำนาจศาลในการแสวงหาข้อเท็จจริงได้ อย่างกว้างขวาง และเป็นผู้ดำเนินกระบวนพิจารณาเอง</p>
            <p>อย่างไรก็ดี การพิจารณาคดีปกครองยังคงต้องเคารพหลักทั่วไปของระบบวิธีพิจารณาคดี อันเป็นหลักการที่มุ่งเน้นให้มีการพิจารณาคดีอย่างยุติธรรมและมีประสิทธิภาพ เช่น การฟังความสองฝ่าย การพิจารณาไปตามกรอบของคำฟ้องและคำขอท้ายฟ้อง การคัดค้านตุลาการ เป็นต้น จากหลักการของกระบวนพิจารณาคดีปกครองดังกล่าวข้างต้น ได้นำมาสู่การวางระบบวิธีพิจารณาคดีปกครองที่ส่วนหนึ่งอันเป็นกรอบสาระสำคัญ ได้บัญญัติไว้ในพระราชบัญญัติจัดตั้งศาลปกครองและวิธีพิจารณาคดีปกครอง พ.ศ. 2542 และอีกส่วนหนึ่งกำหนดไว้ในระเบียบของที่ประชุมใหญ่ตุลาการในศาลปกครองสูงสุด ว่าด้วยวิธีพิจารณาคดีปกครอง พ.ศ. 2543</p>
        </>,
    },
    { 
        id: 5, 
        status: '', 
        title: 'ตัวอย่างคดีที่ฟ้องต่อศาลปกครองไม่ได้', 
        desc: <>
            <p>เนื่องจากคดีปกครองมีลักษณะพิเศษต่างไปจากคดีแพ่งและคดีอาญา ดังนั้น จึงต้องมีวิธีพิจารณาที่เหมาะสมกับสภาพของคดีปกครองเอง ซึ่งได้แก่วิธีพิจารณาแบบไต่สวน อันเป็นวิธีการที่มีหลักสำคัญในการให้อำนาจศาลในการแสวงหาข้อเท็จจริงได้ อย่างกว้างขวาง และเป็นผู้ดำเนินกระบวนพิจารณาเอง</p>
            <p>อย่างไรก็ดี การพิจารณาคดีปกครองยังคงต้องเคารพหลักทั่วไปของระบบวิธีพิจารณาคดี อันเป็นหลักการที่มุ่งเน้นให้มีการพิจารณาคดีอย่างยุติธรรมและมีประสิทธิภาพ เช่น การฟังความสองฝ่าย การพิจารณาไปตามกรอบของคำฟ้องและคำขอท้ายฟ้อง การคัดค้านตุลาการ เป็นต้น จากหลักการของกระบวนพิจารณาคดีปกครองดังกล่าวข้างต้น ได้นำมาสู่การวางระบบวิธีพิจารณาคดีปกครองที่ส่วนหนึ่งอันเป็นกรอบสาระสำคัญ ได้บัญญัติไว้ในพระราชบัญญัติจัดตั้งศาลปกครองและวิธีพิจารณาคดีปกครอง พ.ศ. 2542 และอีกส่วนหนึ่งกำหนดไว้ในระเบียบของที่ประชุมใหญ่ตุลาการในศาลปกครองสูงสุด ว่าด้วยวิธีพิจารณาคดีปกครอง พ.ศ. 2543</p>
        </>,
    },
    { 
        id: 6, 
        status: '', 
        title: 'ข้อควรระวังในการฟ้องคดี', 
        desc: <>
            <p>เนื่องจากคดีปกครองมีลักษณะพิเศษต่างไปจากคดีแพ่งและคดีอาญา ดังนั้น จึงต้องมีวิธีพิจารณาที่เหมาะสมกับสภาพของคดีปกครองเอง ซึ่งได้แก่วิธีพิจารณาแบบไต่สวน อันเป็นวิธีการที่มีหลักสำคัญในการให้อำนาจศาลในการแสวงหาข้อเท็จจริงได้ อย่างกว้างขวาง และเป็นผู้ดำเนินกระบวนพิจารณาเอง</p>
            <p>อย่างไรก็ดี การพิจารณาคดีปกครองยังคงต้องเคารพหลักทั่วไปของระบบวิธีพิจารณาคดี อันเป็นหลักการที่มุ่งเน้นให้มีการพิจารณาคดีอย่างยุติธรรมและมีประสิทธิภาพ เช่น การฟังความสองฝ่าย การพิจารณาไปตามกรอบของคำฟ้องและคำขอท้ายฟ้อง การคัดค้านตุลาการ เป็นต้น จากหลักการของกระบวนพิจารณาคดีปกครองดังกล่าวข้างต้น ได้นำมาสู่การวางระบบวิธีพิจารณาคดีปกครองที่ส่วนหนึ่งอันเป็นกรอบสาระสำคัญ ได้บัญญัติไว้ในพระราชบัญญัติจัดตั้งศาลปกครองและวิธีพิจารณาคดีปกครอง พ.ศ. 2542 และอีกส่วนหนึ่งกำหนดไว้ในระเบียบของที่ประชุมใหญ่ตุลาการในศาลปกครองสูงสุด ว่าด้วยวิธีพิจารณาคดีปกครอง พ.ศ. 2543</p>
        </>,
    },
    { 
        id: 7, 
        status: '', 
        title: 'คำแนะนำ/ข้อบังคับ', 
        desc: <>
            <p>เนื่องจากคดีปกครองมีลักษณะพิเศษต่างไปจากคดีแพ่งและคดีอาญา ดังนั้น จึงต้องมีวิธีพิจารณาที่เหมาะสมกับสภาพของคดีปกครองเอง ซึ่งได้แก่วิธีพิจารณาแบบไต่สวน อันเป็นวิธีการที่มีหลักสำคัญในการให้อำนาจศาลในการแสวงหาข้อเท็จจริงได้ อย่างกว้างขวาง และเป็นผู้ดำเนินกระบวนพิจารณาเอง</p>
            <p>อย่างไรก็ดี การพิจารณาคดีปกครองยังคงต้องเคารพหลักทั่วไปของระบบวิธีพิจารณาคดี อันเป็นหลักการที่มุ่งเน้นให้มีการพิจารณาคดีอย่างยุติธรรมและมีประสิทธิภาพ เช่น การฟังความสองฝ่าย การพิจารณาไปตามกรอบของคำฟ้องและคำขอท้ายฟ้อง การคัดค้านตุลาการ เป็นต้น จากหลักการของกระบวนพิจารณาคดีปกครองดังกล่าวข้างต้น ได้นำมาสู่การวางระบบวิธีพิจารณาคดีปกครองที่ส่วนหนึ่งอันเป็นกรอบสาระสำคัญ ได้บัญญัติไว้ในพระราชบัญญัติจัดตั้งศาลปกครองและวิธีพิจารณาคดีปกครอง พ.ศ. 2542 และอีกส่วนหนึ่งกำหนดไว้ในระเบียบของที่ประชุมใหญ่ตุลาการในศาลปกครองสูงสุด ว่าด้วยวิธีพิจารณาคดีปกครอง พ.ศ. 2543</p>
        </>,
    },
    { 
        id: 8, 
        status: '', 
        title: 'ลักษณะของคดีปกครอง', 
        desc: <>
            <p>เนื่องจากคดีปกครองมีลักษณะพิเศษต่างไปจากคดีแพ่งและคดีอาญา ดังนั้น จึงต้องมีวิธีพิจารณาที่เหมาะสมกับสภาพของคดีปกครองเอง ซึ่งได้แก่วิธีพิจารณาแบบไต่สวน อันเป็นวิธีการที่มีหลักสำคัญในการให้อำนาจศาลในการแสวงหาข้อเท็จจริงได้ อย่างกว้างขวาง และเป็นผู้ดำเนินกระบวนพิจารณาเอง</p>
            <p>อย่างไรก็ดี การพิจารณาคดีปกครองยังคงต้องเคารพหลักทั่วไปของระบบวิธีพิจารณาคดี อันเป็นหลักการที่มุ่งเน้นให้มีการพิจารณาคดีอย่างยุติธรรมและมีประสิทธิภาพ เช่น การฟังความสองฝ่าย การพิจารณาไปตามกรอบของคำฟ้องและคำขอท้ายฟ้อง การคัดค้านตุลาการ เป็นต้น จากหลักการของกระบวนพิจารณาคดีปกครองดังกล่าวข้างต้น ได้นำมาสู่การวางระบบวิธีพิจารณาคดีปกครองที่ส่วนหนึ่งอันเป็นกรอบสาระสำคัญ ได้บัญญัติไว้ในพระราชบัญญัติจัดตั้งศาลปกครองและวิธีพิจารณาคดีปกครอง พ.ศ. 2542 และอีกส่วนหนึ่งกำหนดไว้ในระเบียบของที่ประชุมใหญ่ตุลาการในศาลปกครองสูงสุด ว่าด้วยวิธีพิจารณาคดีปกครอง พ.ศ. 2543</p>
        </>,
    },
]; 