// types
import {detailCMS} from "@/types/detail";

export const AdmincourtThingsToKnowFeesDetailCMS: detailCMS = {
    id: 1,
    text: 
    <>
        <table>
            <thead>
                <tr>
                    <th></th>
                    <th style={{ width: '25%' }}>ทุนทรัพย์</th>
                    <th style={{ width: '25%' }}>อัตราค่าธรรมเนียมศาล</th>
                </tr>
            </thead>
            <tbody>
                <tr>
                    <td>
                        การฟ้องคดีขอให้ส่งให้ใช้เงินหรือส่งมอบทรัพย์สิน <br />
                        อันสืบเนื่องจากคดีตามมาตรา 9 วรรคหนึ่ง (3) หรือ (4)
                    </td>
                    <td>
                        ไม่เกิน 50 ล้านบาท <br />
                        ส่วนที่เกิน 50 ล้านบาทขึ้นไป
                    </td>
                    <td>
                        ร้อยละ 2 ไม่เกิน 200,000 บาท <br />
                        ร้อยละ 0.1
                    </td>
                </tr>
            </tbody>
        </table>
        <p>ทั้งนี้ หากค่าธรรมเนียมศาลดังกล่าวรวมแล้วมีเศษไม่ถึงหนึ่งบาทให้ปัดทิ้ง</p>
        <p>
            <strong>1. วิธีชำระค่าธรรมเนียมศาล</strong><br />
            <strong>กรณียื่นฟ้องต่อศาลปกครองกลาง</strong> (คดีฟ้องใหม่ คดีฟ้องแย้ง คดีรับโอนและคดีชั้นอุทธรณ์) ชำระเป็น <br />
            1. เงินสด <br />
            2. เช็คซึ่งส่วนราชการหรือรัฐวิสาหกิจเป็นผู้สั่งจ่าย <br />
            3. เช็คที่ธนาคารรับรอง ได้แก่ <br />
            3.1 ตั๋วแลกเงินธนาคาร <br />
            3.2 ดราฟต์ <br />
            3.3 แคชเชียร์เช็ค (ใช้เฉพาะธนาคารในเขตกรุงเทพฯและปริมณฑล เนื่องจากแคชเชียร์เช็คของธนาคารในเขตต่างจังหวัด เมื่อนำมาเข้าบัญชีที่กรุงเทพฯ <br />
            จะมีค่าธรรมเนียมในการเรียกเก็บเงินตามเช็ค ทำให้จำนวนเงินที่ศาลรับชำระไม่ตรงตามเช็ค จึงส่งผลให้ผู้ฟ้องคดีชำระเงินไม่ครบถ้วน) <br />
            <strong>ทั้งนี้ ให้ธนาคารสั่งจ่ายเงินชื่อบัญชี "เงินค่าธรรมเนียมและเงินค่าปรับของสำนักงานศาลปกครองกลาง"</strong>
        </p>
        <p>
            4. บัตรเครดิต บัตรเดบิต หรือบัตรอื่นในลักษณะเดียวกัน
            <strong>หมายเหตุ</strong><br />
            <strong>หากมีค่าธรรมเนียมหรือค่าใช้จ่ายอย่างอื่นในการเรียกเก็บเงินตามวิธีการดังกล่าวให้ผู้มีหน้าที่ต้องชำระค่าธรรมเนียมศาลเป็นผู้รับภาระ กรณียื่นฟ้องตรงต่อศาลปกครองสูงสุด (คดี ฟ.)</strong><br />
            ชำระเป็น <br />
            1. เงินสด <br />
            2. เช็คซึ่งส่วนราชการหรือรัฐวิสาหกิจเป็นผู้สั่งจ่าย <br />
            3. เช็คที่ธนาคารรับรอง ได้แก่ <br />
            3.1 ตั๋วแลกเงินธนาคาร <br />
            3.2 ดราฟต์ <br />
            3.3 แคชเชียร์เช็ค (ใช้เฉพาะธนาคารในเขตกรุงเทพฯและปริมณฑล เนื่องจากแคชเชียร์เช็คของธนาคารในเขตต่างจังหวัด เมื่อนำมาเข้าบัญชีที่กรุงเทพฯ จะมีค่าธรรมเนียมในการเรียกเก็บเงินตามเช็ค ทำให้จำนวนเงิน ที่ศาลรับชำระไม่ตรงตามเช็ค จึงส่งผลให้ผู้ฟ้องคดีชำระเงินไม่ครบถ้วน)
        </p>
        <p>
            <strong><u>2. วิธีชำระเงินวางชำระตามคำพิพากษา / เงินบังคับคดี</u></strong><br />
            <strong><u>กรณีเป็นคดีที่ยื่นฟ้องต่อศาลปกครองกลาง</u></strong><br />
            ชำระเป็น<br />
            1. เงินสด<br />
            2. เช็คซึ่งส่วนราชการหรือรัฐวิสาหกิจเป็นผู้สั่งจ่าย<br />
            3. เช็คที่ธนาคารรับรอง ได้แก่<br />
            3.1 ตั๋วแลกเงินธนาคาร<br />
            3.2 ดราฟต์<br />
            3.3 แคชเชียร์เช็ค (ใช้เฉพาะธนาคารในเขตกรุงเทพฯและปริมณฑล เนื่องจากแคชเชียร์เช็คของธนาคารในเขตต่างจังหวัด เมื่อนำมาเข้าบัญชีที่กรุงเทพฯ จะมีค่าธรรมเนียมในการเรียกเก็บเงินตามเช็ค ทำให้จำนวนเงินที่ศาลรับชำระไม่ตรงตามเช็ค จึงส่งผลให้ลูกหนี้ตามคำพิพากษาชำระเงินไม่ครบถ้วน)
            <br />
            <strong>ทั้งนี้ ให้ ธนาคารสั่งจ่ายเงินชื่อบัญชี "เงินกลางของสำนักงานศาลปกครองกลาง"</strong><br />
            4. บัตรเครดิต บัตรเดบิต หรือบัตรอื่นในลักษณะเดียวกัน<br />
            <strong>หมายเหตุ</strong><br />
            <strong>หากมีค่าธรรมเนียมหรือค่าใช้จ่ายอย่างอื่นในการเรียกเก็บเงินตามวิธีการดังกล่าวให้ผู้มีหน้าที่ต้องชำระเงินวางชำระตามคำพิพากษา/เงินบังคับคดี เป็นผู้รับภาระ</strong>
        </p>
        <p>
            <strong><u>กรณีเป็นคดีที่ยื่นฟ้องตรงต่อศาลปกครองสูงสุด (คดี ฟ.)</u></strong><br />
            ชำระเป็น<br />
            1. เงินสด<br />
            2. เช็คซึ่งส่วนราชการหรือรัฐวิสาหกิจเป็นผู้สั่งจ่าย<br />
            3. เช็คที่ธนาคารรับรอง ได้แก่<br />
            3.1 ตั๋วแลกเงินธนาคาร<br />
            3.2 ดราฟต์<br />
            3.3 แคชเชียร์เช็ค (ใช้เฉพาะธนาคารในเขตกรุงเทพฯและปริมณฑล เนื่องจากแคชเชียร์เช็คของธนาคารในเขตต่างจังหวัด เมื่อนำมาเข้าบัญชีที่กรุงเทพฯ จะมีค่าธรรมเนียมในการเรียกเก็บเงินตามเช็ค ทำให้จำนวนเงินที่ศาลรับชำระไม่ตรงตามเช็ค จึงส่งผลให้ลูกหนี้ตามคำพิพากษาชำระเงินไม่ครบถ้วน)
            <br />
            <strong>ทั้งนี้ ให้ ธนาคารสั่งจ่ายเงินชื่อบัญชี "เงินกลางของสำนักงานศาลปกครองสูงสุด"</strong><br />
            4. บัตรเครดิต บัตรเดบิต หรือบัตรอื่นในลักษณะเดียวกัน
            <strong>หมายเหตุ</strong><br />
            <strong>หากมีค่าธรรมเนียมหรือค่าใช้จ่ายอย่างอื่นในการเรียกเก็บเงินตามวิธีการดังกล่าวให้ผู้มีหน้าที่ต้องชำระเงินวางชำระตามคำพิพากษา/เงินบังคับคดี เป็นผู้รับภาระ   </strong>
        </p>
        <p>
            <strong>หากมีข้อสงสัย สอบถามได้ที่กลุ่มบริหารเงินค่าธรรมเนียมและเงินกลาง สำนักบริหารการเงินและต้นทุน</strong><br />
            <strong>โทรศัพท์ 0-2141-0280-1, 0-2141-0276-7 , 02-141-0283, 02-141-0193</strong><br />
        </p>
        <p>
            <strong>หมายเหตุ</strong><br />
            1. คดีที่ยื่นฟ้องก่อนวันที่ 11 พ.ค. 2551 แต่ยังไม่ได้ชำระค่าธรรมเนียมศาลให้คิดค่าธรรมเนียมศาลในอัตราเดิมแม้จะชำระค่าธรรมเนียมศาลหลังวันที่ 11 พ.ค. 2551 ก็ตาม <br />
            2. ค่าธรรมเนียมศาลในชั้นอุทธรณ์ ให้ใช้อัตราเดียวกับค่าธรรมเนียมศาลชั้นต้น <br />
            3. การขอคืนค่าธรรมเนียมศาลและขอรับเงินวางชำระตามคำพิพากษายื่นคำร้องตามแบบฟอร์มของศาลพร้อมแนบหลักฐาน <strong><u>(เอกสารแนบ)</u></strong> 
            และรอเจ้าหน้าที่การเงินติดต่อกลับ
        </p>
        <p>
            <strong>หมายเหตุ</strong><br />
            <strong>คู่กรณีสามารถยื่นคำร้องขอคืนค่าธรรมเนียม และขอรับเงินวางชำระตามคำพิพากษาคืนได้ เมื่อคดีถึงที่สุดแล้ว</strong>
        </p>
    </>,
};