// types
import {LayoutListItemSlide} from "@/types/list";

export const OfficeLibraryListItem: LayoutListItemSlide[] = [
    { 
        id: 1, 
        hTitle: 'หอสมุดกฎหมายมหาชน', 
        itemSlide:[
            {
                id: 1, 
                date: '10.02.2025', 
                image: '/img/upload/infomation.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 2, 
                date: '10.02.2025', 
                image: '/img/upload/infomation.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 3, 
                date: '10.02.2025', 
                image: '/img/upload/infomation.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 4, 
                date: '10.02.2025', 
                image: '/img/upload/infomation.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 5, 
                date: '10.02.2025', 
                image: '/img/upload/infomation.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 6, 
                date: '10.02.2025', 
                image: '/img/upload/infomation.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
        ]
    },
    { 
        id: 2, 
        hTitle: 'พิพิธภัณฑ์ศาลปกครอง', 
        itemSlide:[
            {
                id: 1, 
                date: '10.02.2025', 
                image: '/img/upload/info-graphic.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 2, 
                date: '10.02.2025', 
                image: '/img/upload/info-graphic.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 3, 
                date: '10.02.2025', 
                image: '/img/upload/info-graphic.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 4, 
                date: '10.02.2025', 
                image: '/img/upload/info-graphic.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 5, 
                date: '10.02.2025', 
                image: '/img/upload/info-graphic.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 6, 
                date: '10.02.2025', 
                image: '/img/upload/info-graphic.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
        ]
    },
    { 
        id: 3, 
        hTitle: 'จดหมายเหตุศาลปกครอง', 
        itemSlide:[
            {
                id: 1, 
                date: '10.02.2025', 
                image: '/img/upload/news-book.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 2, 
                date: '10.02.2025', 
                image: '/img/upload/news-book.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 3, 
                date: '10.02.2025', 
                image: '/img/upload/news-book.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 4, 
                date: '10.02.2025', 
                image: '/img/upload/news-book.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 5, 
                date: '10.02.2025', 
                image: '/img/upload/news-book.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
            {
                id: 6, 
                date: '10.02.2025', 
                image: '/img/upload/news-book.jpg', 
                title: 'ประธานศาลปกครองสูงสุดแถลงนโยบายเน้นย้ำการบริหารจัดการคดีและบังคับคดีด้วยความเป็นธรรม รวดเร็ว พร้อมยกระดับการปฏิบัติงานด้วยเทคโนโลยี ก้าวสู่ศาลปกครองอิเล็กทรอนิกส์ที่สมบูรณ์', 
                linkUrl: '/public-relations/detail',
            },
        ]
    },
]; 