// types
import {LayoutListAccordion} from "@/types/list";

export const AdmincourtThingsToKnowJudicialProceedingsListItemList: LayoutListAccordion[] = [
    { 
        id: 1, 
        status: 'open', 
        title: 'การดำเนินกระบวนการพิจารณาคดี', 
        desc: <>
            <p>ในส่วนที่เกี่ยวกับวิธีพิจารณาคดีในศาลปกครองนั้นจะใช้ ระบบไต่สวนแทนที่จะเป็น ระบบกล่าวหาอย่างที่ประชาชนทั่วไปคุ้นเคย ก่อนอื่นจะต้องเข้าใจถึงความแตกต่างในพื้นฐาน ระหว่างวิธีพิจารณาคดีปกครองในศาลปกครองกับวิธีพิจารณาคดีแพ่งในศาลยุติธรรมที่นักกฎหมายไทยส่วนใหญ่มีความเข้าใจและคุ้นเคยตลอดเวลาที่ผ่านมา</p>
        </>,
    },
    { 
        id: 2, 
        status: '', 
        title: 'กระบวนการพิจารณาแบบไต่สวน', 
        desc: <>
            <p>ในส่วนที่เกี่ยวกับวิธีพิจารณาคดีในศาลปกครองนั้นจะใช้ ระบบไต่สวนแทนที่จะเป็น ระบบกล่าวหาอย่างที่ประชาชนทั่วไปคุ้นเคย ก่อนอื่นจะต้องเข้าใจถึงความแตกต่างในพื้นฐาน ระหว่างวิธีพิจารณาคดีปกครองในศาลปกครองกับวิธีพิจารณาคดีแพ่งในศาลยุติธรรมที่นักกฎหมายไทยส่วนใหญ่มีความเข้าใจและคุ้นเคยตลอดเวลาที่ผ่านมา</p>
        </>,
    },
    { 
        id: 3, 
        status: '', 
        title: 'การตรวจคำฟ้อง', 
        desc: <>
            <p>ในส่วนที่เกี่ยวกับวิธีพิจารณาคดีในศาลปกครองนั้นจะใช้ ระบบไต่สวนแทนที่จะเป็น ระบบกล่าวหาอย่างที่ประชาชนทั่วไปคุ้นเคย ก่อนอื่นจะต้องเข้าใจถึงความแตกต่างในพื้นฐาน ระหว่างวิธีพิจารณาคดีปกครองในศาลปกครองกับวิธีพิจารณาคดีแพ่งในศาลยุติธรรมที่นักกฎหมายไทยส่วนใหญ่มีความเข้าใจและคุ้นเคยตลอดเวลาที่ผ่านมา</p>
        </>,
    },
    { 
        id: 4, 
        status: '', 
        title: 'กระบวนการพิจารณาคดีชั้นการแสวงหาข้อเท็จจริง', 
        desc: <>
            <p>ในส่วนที่เกี่ยวกับวิธีพิจารณาคดีในศาลปกครองนั้นจะใช้ ระบบไต่สวนแทนที่จะเป็น ระบบกล่าวหาอย่างที่ประชาชนทั่วไปคุ้นเคย ก่อนอื่นจะต้องเข้าใจถึงความแตกต่างในพื้นฐาน ระหว่างวิธีพิจารณาคดีปกครองในศาลปกครองกับวิธีพิจารณาคดีแพ่งในศาลยุติธรรมที่นักกฎหมายไทยส่วนใหญ่มีความเข้าใจและคุ้นเคยตลอดเวลาที่ผ่านมา</p>
        </>,
    },
    { 
        id: 5, 
        status: '', 
        title: 'การสรุปสำนวน', 
        desc: <>
            <p>ในส่วนที่เกี่ยวกับวิธีพิจารณาคดีในศาลปกครองนั้นจะใช้ ระบบไต่สวนแทนที่จะเป็น ระบบกล่าวหาอย่างที่ประชาชนทั่วไปคุ้นเคย ก่อนอื่นจะต้องเข้าใจถึงความแตกต่างในพื้นฐาน ระหว่างวิธีพิจารณาคดีปกครองในศาลปกครองกับวิธีพิจารณาคดีแพ่งในศาลยุติธรรมที่นักกฎหมายไทยส่วนใหญ่มีความเข้าใจและคุ้นเคยตลอดเวลาที่ผ่านมา</p>
        </>,
    },
    { 
        id: 6, 
        status: '', 
        title: 'การนั่งพิจารณาคดีและการแถลงการณ์ของตุลาการผู้แถลงคดี', 
        desc: <>
            <p>ในส่วนที่เกี่ยวกับวิธีพิจารณาคดีในศาลปกครองนั้นจะใช้ ระบบไต่สวนแทนที่จะเป็น ระบบกล่าวหาอย่างที่ประชาชนทั่วไปคุ้นเคย ก่อนอื่นจะต้องเข้าใจถึงความแตกต่างในพื้นฐาน ระหว่างวิธีพิจารณาคดีปกครองในศาลปกครองกับวิธีพิจารณาคดีแพ่งในศาลยุติธรรมที่นักกฎหมายไทยส่วนใหญ่มีความเข้าใจและคุ้นเคยตลอดเวลาที่ผ่านมา</p>
        </>,
    },
    { 
        id: 7, 
        status: '', 
        title: 'การละเมิดอำนาจศาล', 
        desc: <>
            <p>ในส่วนที่เกี่ยวกับวิธีพิจารณาคดีในศาลปกครองนั้นจะใช้ ระบบไต่สวนแทนที่จะเป็น ระบบกล่าวหาอย่างที่ประชาชนทั่วไปคุ้นเคย ก่อนอื่นจะต้องเข้าใจถึงความแตกต่างในพื้นฐาน ระหว่างวิธีพิจารณาคดีปกครองในศาลปกครองกับวิธีพิจารณาคดีแพ่งในศาลยุติธรรมที่นักกฎหมายไทยส่วนใหญ่มีความเข้าใจและคุ้นเคยตลอดเวลาที่ผ่านมา</p>
        </>,
    },
    { 
        id: 8, 
        status: '', 
        title: 'คำพิพากษาและคำสั่งของศาล', 
        desc: <>
            <p>ในส่วนที่เกี่ยวกับวิธีพิจารณาคดีในศาลปกครองนั้นจะใช้ ระบบไต่สวนแทนที่จะเป็น ระบบกล่าวหาอย่างที่ประชาชนทั่วไปคุ้นเคย ก่อนอื่นจะต้องเข้าใจถึงความแตกต่างในพื้นฐาน ระหว่างวิธีพิจารณาคดีปกครองในศาลปกครองกับวิธีพิจารณาคดีแพ่งในศาลยุติธรรมที่นักกฎหมายไทยส่วนใหญ่มีความเข้าใจและคุ้นเคยตลอดเวลาที่ผ่านมา</p>
        </>,
    },
    { 
        id: 9, 
        status: '', 
        title: 'การอุทธรณ์', 
        desc: <>
            <p>ในส่วนที่เกี่ยวกับวิธีพิจารณาคดีในศาลปกครองนั้นจะใช้ ระบบไต่สวนแทนที่จะเป็น ระบบกล่าวหาอย่างที่ประชาชนทั่วไปคุ้นเคย ก่อนอื่นจะต้องเข้าใจถึงความแตกต่างในพื้นฐาน ระหว่างวิธีพิจารณาคดีปกครองในศาลปกครองกับวิธีพิจารณาคดีแพ่งในศาลยุติธรรมที่นักกฎหมายไทยส่วนใหญ่มีความเข้าใจและคุ้นเคยตลอดเวลาที่ผ่านมา</p>
        </>,
    },
    { 
        id: 10, 
        status: '', 
        title: 'การบังคับคดีปกครอง', 
        desc: <>
            <p>ในส่วนที่เกี่ยวกับวิธีพิจารณาคดีในศาลปกครองนั้นจะใช้ ระบบไต่สวนแทนที่จะเป็น ระบบกล่าวหาอย่างที่ประชาชนทั่วไปคุ้นเคย ก่อนอื่นจะต้องเข้าใจถึงความแตกต่างในพื้นฐาน ระหว่างวิธีพิจารณาคดีปกครองในศาลปกครองกับวิธีพิจารณาคดีแพ่งในศาลยุติธรรมที่นักกฎหมายไทยส่วนใหญ่มีความเข้าใจและคุ้นเคยตลอดเวลาที่ผ่านมา</p>
        </>,
    },
]; 