// types
import {detailCMS} from "@/types/detail";

export const OfficeCultureDetailCMS: detailCMS = {
    id: 1,
    text: 
    <>
        <div className="ck-culture">
            <div className="head">
                <h2>
                    <span>T</span>
                    <span>R</span>
                    <span>U</span>
                    <span>S</span>
                    <span>T</span>
                </h2>
            </div>
            <div className="body">
                <p>
                    <strong>
                        <span>T</span>
                        <span>R</span>
                        <span>U</span>
                        <span>S</span>
                        <span>T</span>
                    </strong>
                    เป็นความเชื่อ ค่านิยม และแบบพฤติกรรมร่วมที่บุคลากรศาลปกครองทุกคนได้ยึดถือและปฏิบัติทั้งต่องาน และต่อผู้อื่นอันสะท้อนให้เห็นถึงวิถีชีวิตและวิธีทำงานที่เป็นเอกลักษณ์ของ ศาลปกครองที่ให้ความสำคัญกับการปฏิบัติงานด้วยความโปร่งใส (Transparency) การยึดมั่นในความถูกต้อง (Righteousness) ความมีเอกภาพในการปฏิบัติหน้าที่ (Unity) และการส่งมอบผลงานที่มีคุณภาพมาตรฐาน (Standard) ท่ามกลางบรรยากาศที่ร่วมมือร่วมใจกันทำงานเป็นทีม (Teamwork) อย่างเข้มแข็ง หรือที่เราเรียกรวมกันว่า "TRUST"
                </p>
                <p>
                    วัฒนธรรมศาลปกครองจะเกิดขึ้นได้ ดำรงอยู่อย่างยั่งยืนและสานต่อไปยังบุคลากรศาลปกครองจากรุ่นสู่รุ่นอย่างต่อเนื่อง พวกเราซึ่งเป็นบุคลากรทุกส่วนของศาลปกครอง ต้องพร้อมใจกันสร้างวัฒนธรรมศาลปกครองที่เป็นเอกลักษณ์ให้เกิดขึ้นในวันนี้และทุกๆ วัน จากหนึ่งคนสู่หลายคน และทุกๆคน ด้วยความเชื่อมั่นว่าไม่ว่าเราจะปฏิบัติหน้าที่ใด เราต่างล้วนปฏิบัติงานด้วยความ "โปร่งใส ถูกต้อง เป็นเอกภาพ มีมาตรฐาน และทำงานเป็นทีม" เพื่อให้ศาลปกครองที่เราทุกคนต่างภูมิใจ เป็นเสาหลักในการอำนวยความยุติธรรมทางการปกครองให้กับประชาชน และเป็นศาลปกครองแห่งความเชื่อมั่นของประชาชนตลอดไป
                </p>
            </div>
            <div className="foot">
                <div className="row">
                    <div className="col-auto">
                        Transparency : โปร่งใส
                    </div>
                    <div className="col">
                        บุคลากรศาลปกครอง เป็นผู้ที่มุ่งมั่นปฏิบัติงานอย่างเต็มกำลังความสามารถ เพื่อประโยชน์ต่อส่วนรวมและองค์กรด้วยความโปร่งใสเปิดเผยตรงไปตรงมา และสามารถตรวจสอบได้
                    </div>
                </div>
                <div className="row">
                    <div className="col-auto">
                        Righteousness : ถูกต้อง
                    </div>
                    <div className="col">
                        บุคลากรศาลปกครอง เป็นผู้ที่ตั้งมั่นปฏิบัติงานตามจรรยาบรรณวิชาชีพด้วยความถูกต้อง เป็นกลาง ไม่เลือกปฏิบัติ ซื่อสัตย์สุจริต และยึดมั่นในคุณธรรมจริยธรรม
                    </div>
                </div>
                <div className="row">
                    <div className="col-auto">
                        Unity : เป็นเอกภาพ
                    </div>
                    <div className="col">
                        บุคลากรศาลปกครอง เป็นผู้ที่ยึดมั่นปฏิบัติงานด้วยความเป็นน้ำหนึ่งใจเดียวกัน คำนึงถึงประโยชน์ขององค์กรเป็นสำคัญ ภาคภูมิใจในการเป็นส่วนหนึ่งขององค์กร มีความรักและภักดีต่อองค์กร
                    </div>
                </div>
                <div className="row">
                    <div className="col-auto">
                        Standard : มีมาตรฐาน
                    </div>
                    <div className="col">
                        บุคลากรศาลปกครอง เป็นผู้ที่มุ่งมั่นปฏิบัติงานอย่างมืออาชีพ มีมาตรฐาน รับผิดชอบ เป็นระบบ สร้างสรรค์งานอย่างมีคุณภาพและเป็นที่ยอมรับ
                    </div>
                </div>
                <div className="row">
                    <div className="col-auto">
                        Teamwork : ทำงานเป็นทีม
                    </div>
                    <div className="col">
                        บุคลากรศาลปกครอง เป็นผู้ที่ยึดมั่นปฏิบัติงานด้วยความร่วมมือร่วมใจ ทำงานเป็นทีมอย่างเข้มแข็ง เคารพให้เกียรติซึ่งกันและกัน
                    </div>
                </div>
            </div>
        </div>
    </>,
};