// types
import {LayoutListDownloadSearch} from "@/types/list";

export const SearchInformationAppointmentListItem: LayoutListDownloadSearch[] = [
    { 
        id: 1, 
        hTitle: '35/2562', 
        hNumber: 'ยังไม่ออกคดีหมายเลขแดง', 
        linkUrl: '/search-information/detail2',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        boxList:[
                                  
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '8 สิงหาคม 2562', 
            },
            {
                id: 2, 
                title: 'ประเภทการนัดหมาย', 
                desc: 'นั่งพิจารณาคดี', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีที่มีกฎหมายกำหนดให้อยู่ในอำนาจศาลปกครองสูงสุด (ม.116 ว.2 แห่ง พ.ร.บ. ระเบียบข้าราชการพลเรือน พ.ศ. 2551)', 
            },
            {
                id: 4, 
                title: 'วันที่นัด', 
                desc: '27 มีนาคม 2568', 
            },
            {
                id: 5, 
                title: 'เวลานัด', 
                desc: '09:30น.- 12:00 น.', 
            },
            {
                id: 6, 
                title: 'สถานที่', 
                desc: 'ห้องพิจารณาคดี 4 (ชั้น3)', 
            },
        ]
    },
    { 
        id: 2, 
        hTitle: '35/2562', 
        hNumber: 'ยังไม่ออกคดีหมายเลขแดง', 
        linkUrl: '/search-information/detail2',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        boxList:[
                                  
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '8 สิงหาคม 2562', 
            },
            {
                id: 2, 
                title: 'ประเภทการนัดหมาย', 
                desc: 'นั่งพิจารณาคดี', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีที่มีกฎหมายกำหนดให้อยู่ในอำนาจศาลปกครองสูงสุด (ม.116 ว.2 แห่ง พ.ร.บ. ระเบียบข้าราชการพลเรือน พ.ศ. 2551)', 
            },
            {
                id: 4, 
                title: 'วันที่นัด', 
                desc: '27 มีนาคม 2568', 
            },
            {
                id: 5, 
                title: 'เวลานัด', 
                desc: '09:30น.- 12:00 น.', 
            },
            {
                id: 6, 
                title: 'สถานที่', 
                desc: 'ห้องพิจารณาคดี 4 (ชั้น3)', 
            },
        ]
    },
    { 
        id: 3, 
        hTitle: '35/2562', 
        hNumber: 'ยังไม่ออกคดีหมายเลขแดง', 
        linkUrl: '/search-information/detail2',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        boxList:[
                                  
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '8 สิงหาคม 2562', 
            },
            {
                id: 2, 
                title: 'ประเภทการนัดหมาย', 
                desc: 'นั่งพิจารณาคดี', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีที่มีกฎหมายกำหนดให้อยู่ในอำนาจศาลปกครองสูงสุด (ม.116 ว.2 แห่ง พ.ร.บ. ระเบียบข้าราชการพลเรือน พ.ศ. 2551)', 
            },
            {
                id: 4, 
                title: 'วันที่นัด', 
                desc: '27 มีนาคม 2568', 
            },
            {
                id: 5, 
                title: 'เวลานัด', 
                desc: '09:30น.- 12:00 น.', 
            },
            {
                id: 6, 
                title: 'สถานที่', 
                desc: 'ห้องพิจารณาคดี 4 (ชั้น3)', 
            },
        ]
    },
    { 
        id: 4, 
        hTitle: '35/2562', 
        hNumber: 'ยังไม่ออกคดีหมายเลขแดง', 
        linkUrl: '/search-information/detail2',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        boxList:[
                                  
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '8 สิงหาคม 2562', 
            },
            {
                id: 2, 
                title: 'ประเภทการนัดหมาย', 
                desc: 'นั่งพิจารณาคดี', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีที่มีกฎหมายกำหนดให้อยู่ในอำนาจศาลปกครองสูงสุด (ม.116 ว.2 แห่ง พ.ร.บ. ระเบียบข้าราชการพลเรือน พ.ศ. 2551)', 
            },
            {
                id: 4, 
                title: 'วันที่นัด', 
                desc: '27 มีนาคม 2568', 
            },
            {
                id: 5, 
                title: 'เวลานัด', 
                desc: '09:30น.- 12:00 น.', 
            },
            {
                id: 6, 
                title: 'สถานที่', 
                desc: 'ห้องพิจารณาคดี 4 (ชั้น3)', 
            },
        ]
    },
    { 
        id: 5, 
        hTitle: '35/2562', 
        hNumber: 'ยังไม่ออกคดีหมายเลขแดง', 
        linkUrl: '/search-information/detail2',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        boxList:[
                                  
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '8 สิงหาคม 2562', 
            },
            {
                id: 2, 
                title: 'ประเภทการนัดหมาย', 
                desc: 'นั่งพิจารณาคดี', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีที่มีกฎหมายกำหนดให้อยู่ในอำนาจศาลปกครองสูงสุด (ม.116 ว.2 แห่ง พ.ร.บ. ระเบียบข้าราชการพลเรือน พ.ศ. 2551)', 
            },
            {
                id: 4, 
                title: 'วันที่นัด', 
                desc: '27 มีนาคม 2568', 
            },
            {
                id: 5, 
                title: 'เวลานัด', 
                desc: '09:30น.- 12:00 น.', 
            },
            {
                id: 6, 
                title: 'สถานที่', 
                desc: 'ห้องพิจารณาคดี 4 (ชั้น3)', 
            },
        ]
    },
    { 
        id: 6, 
        hTitle: '35/2562', 
        hNumber: 'ยังไม่ออกคดีหมายเลขแดง', 
        linkUrl: '/search-information/detail2',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        boxList:[
                                  
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '8 สิงหาคม 2562', 
            },
            {
                id: 2, 
                title: 'ประเภทการนัดหมาย', 
                desc: 'นั่งพิจารณาคดี', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีที่มีกฎหมายกำหนดให้อยู่ในอำนาจศาลปกครองสูงสุด (ม.116 ว.2 แห่ง พ.ร.บ. ระเบียบข้าราชการพลเรือน พ.ศ. 2551)', 
            },
            {
                id: 4, 
                title: 'วันที่นัด', 
                desc: '27 มีนาคม 2568', 
            },
            {
                id: 5, 
                title: 'เวลานัด', 
                desc: '09:30น.- 12:00 น.', 
            },
            {
                id: 6, 
                title: 'สถานที่', 
                desc: 'ห้องพิจารณาคดี 4 (ชั้น3)', 
            },
        ]
    },
    { 
        id: 7, 
        hTitle: '35/2562', 
        hNumber: 'ยังไม่ออกคดีหมายเลขแดง', 
        linkUrl: '/search-information/detail2',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        boxList:[
                                  
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '8 สิงหาคม 2562', 
            },
            {
                id: 2, 
                title: 'ประเภทการนัดหมาย', 
                desc: 'นั่งพิจารณาคดี', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีที่มีกฎหมายกำหนดให้อยู่ในอำนาจศาลปกครองสูงสุด (ม.116 ว.2 แห่ง พ.ร.บ. ระเบียบข้าราชการพลเรือน พ.ศ. 2551)', 
            },
            {
                id: 4, 
                title: 'วันที่นัด', 
                desc: '27 มีนาคม 2568', 
            },
            {
                id: 5, 
                title: 'เวลานัด', 
                desc: '09:30น.- 12:00 น.', 
            },
            {
                id: 6, 
                title: 'สถานที่', 
                desc: 'ห้องพิจารณาคดี 4 (ชั้น3)', 
            },
        ]
    },
    { 
        id: 8, 
        hTitle: '35/2562', 
        hNumber: 'ยังไม่ออกคดีหมายเลขแดง', 
        linkUrl: '/search-information/detail2',
        btnUrl: '#',
        page: '48',
        size: '5.71',
        read: '426',
        boxList:[
                                  
            {
                id: 1, 
                title: 'วันที่รับคำฟ้อง', 
                desc: '8 สิงหาคม 2562', 
            },
            {
                id: 2, 
                title: 'ประเภทการนัดหมาย', 
                desc: 'นั่งพิจารณาคดี', 
            },
            {
                id: 3, 
                title: 'เรื่องตามกรณีข้อพิพาท', 
                desc: 'คดีที่มีกฎหมายกำหนดให้อยู่ในอำนาจศาลปกครองสูงสุด (ม.116 ว.2 แห่ง พ.ร.บ. ระเบียบข้าราชการพลเรือน พ.ศ. 2551)', 
            },
            {
                id: 4, 
                title: 'วันที่นัด', 
                desc: '27 มีนาคม 2568', 
            },
            {
                id: 5, 
                title: 'เวลานัด', 
                desc: '09:30น.- 12:00 น.', 
            },
            {
                id: 6, 
                title: 'สถานที่', 
                desc: 'ห้องพิจารณาคดี 4 (ชั้น3)', 
            },
        ]
    },
]; 